{
  "MediaContainer": {
    "-size": "62",
    "-allowSync": "1",
    "-art": "/:/resources/artist-fanart.jpg",
    "-identifier": "com.plexapp.plugins.library",
    "-librarySectionID": "5",
    "-librarySectionTitle": "Music",
    "-librarySectionUUID": "eabdd2ec-e772-45c9-81bb-db59cc1d9224",
    "-mediaTagPrefix": "/system/bundle/media/flags/",
    "-mediaTagVersion": "1461348494",
    "-nocache": "1",
    "-sortAsc": "1",
    "-thumb": "/:/resources/artist.png",
    "-title1": "Music",
    "-title2": "All Artists",
    "-viewGroup": "artist",
    "-viewMode": "131124",
    "Directory": [
      {
        "-ratingKey": "4123",
        "-key": "/library/metadata/4123/children",
        "-type": "artist",
        "-title": "50 Cent",
        "-summary": "Though he would later struggle with the nature of his fame as well as market expectations, 50 Cent endured substantial obstacles throughout his young yet remarkably dramatic life before becoming the most discussed figure in rap, if not pop music in general, circa 2003. Following an unsuccessful late-'90s run at mainstream success (foiled by an attempt on his life in 2000) and a successful run on the New York mixtape circuit (driven by his early-2000s bout with Ja Rule), Eminem signed 50 Cent to a seven-figure contract in 2002 and helmed his quick rise toward crossover success in 2003. The product of a broken home in the rough Jamaica neighborhood of Queens and, in turn, the storied hood's hustling streets themselves, 50 Cent lived everything most rappers write rhymes about but not all actually experience: drugs, crimes, imprisonments, stabbings, and most infamously of all, shootings. Of course, such experiences became 50 Cent's rhetorical stock-in-trade. He reveled in his oft-told past, he called out wannabe gangstas, and he made headlines. He even looked like the ideal East Coast hardcore rapper: big-framed with oft-showcased biceps, abs, and tattoos as well as his trademark bulletproof vest, pistol, and iced crucifix. But all-importantly, 50 Cent may have fit the mold of a prototypical hardcore rapper, but he could also craft a catchy hook. As a result, his music crossed over to the pop market, appealing to both those who liked his roughneck posturing and rags-to-riches story as well as those who liked his knack for churning out naughty singalong club tracks. And too, 50 Cent didn't forget about his posse. He helped his G-Unit crew grow into a successful franchise, spawning platinum-selling solo albums for his group members, lucrative licensing deals for the brand name, and sell-out arena tours to promote the franchise internationally. By the time of his third album (Curtis, 2007), however, 50 Cent faced a formidable backlash, particularly among hip-hop purists, who were displeased by his turn toward crossover pop-rap and thus away from street-level credibility.
Born Curtis James Jackson III on July 6, 1975, and raised in Southside Jamaica, Queens, New York City, 50 Cent grew up in a broken home. His hustler mother passed away when he was only eight, and his father departed soon after, leaving his grandmother to parent him. As a teen, he followed the lead of his mother and began hustling. The crack trade proved lucrative for 50 Cent, until he eventually encountered the law, that is, and got arrested repeatedly in 1994. It's around this point in time that he traded crime for hip-hop. His break came in 1996 when he met Run-D.M.C.'s Jam Master Jay, who gave him a tape of beats and asked him to rap over it. Impressed by what he heard, Jay signed the aspiring rapper to his JMJ Records label. Not much resulted from the deal, though, and 50 Cent affiliated himself with Trackmasters, a commercially successful New York-based production duo known for their work with such artists as Nas and Jay-Z. Trackmasters signed the rapper to their Columbia sublabel and began work on his debut album, Power of the Dollar. A trio of singles preceded the album's proposed release: \"Your Life's on the Line,\" \"Thug Love\" (featuring Destiny's Child), and \"How to Rob.\" The latter generated a significant buzz, attracting a lot of attention for its baiting lyrics, which detail how 50 Cent would rob specific big-name rappers. This willingness to rap openly and brashly and the attention it attracted came back to haunt him, however. His first post-success brush with death came shortly after the release of \"How to Rob,\" when he was stabbed at the Hit Factory studio on West 54th Street in Manhattan. Shortly afterward came his most storied incident. On May 24, 2000, just before Columbia was set to release Power of the Dollar, an assassin attempted to take 50 Cent's life on 161st Street in Jamaica, Queens (near where Jam Master Jay would later be fatally shot two and half years later), shooting him nine times with a 9mm pistol while the rapper sat helpless in the passenger seat of a car. One shot pierced his cheek, another his hand, and the seven others his legs and thighs, yet he survived, barely. Even so, Columbia wanted nothing to do with 50 Cent when they heard the news, shelving Power of the Dollar and parting ways with the now-controversial rapper.
During the next two years, 50 Cent returned to the rap underground where he began. He formed a collective (G-Unit, which also featured Lloyd Banks and Tony Yayo), worked closely with producer Sha Money XL (who had also been signed to JMJ around the same time that 50 Cent had), and began churning out mixtapes (selections from which were later compiled on Guess Who's Back? in 2002). These mixtape recordings (many of which were hosted by DJ Whoo Kid on CDs such as No Mercy, No Fear and Automatic Gunfire), earned the rapper an esteemed reputation on the streets of New York. Some of them featured 50 Cent and his G-Unit companions rapping over popular beats, others mocked popular rappers (namely Ja Rule, who quickly became an arch-rival), and a few discussed his shooting. This constant mixtape presence throughout 2000-2002 garnered industry attention as well as street esteem, particularly when Eminem declared on a radio show his admiration for 50 Cent. A bidding war ensued, driving up the signing price into the million-plus figures in the process and slowly moving the rapper into the up-and-coming spotlight once again as word spread. Despite the bidding war, Eminem indeed got his man, signing 50 Cent to a joint deal with Shady/Aftermath -- the former label Em's, the latter Dr. Dre's. During the successive months, 50 Cent worked closely with Eminem and Dre, who were both credited as executive produced on his upcoming debut, Get Rich or Die Tryin', each of them producing a few tracks for the highly awaited album. Before Get Rich dropped, though, Eminem debuted 50 Cent on the 8 Mile soundtrack. The song \"Wanksta,\" previously released on the No Mercy, No Fear mixtape, became a runaway hit in late 2002, setting the stage for \"In da Club,\" the Dre-produced lead single from Get Rich. The two singles became sizable crossover hits -- the former peaking at number 13 on Billboard's Hot 100 chart, the latter at number one -- and Interscope (Shady/Aftermath's parent company) consequently had to move up Get Rich's release date to combat bootlegging.
Amid all this, 50 Cent made headlines repeatedly. Most notably, he was tied to Jam Master Jay's shooting in October 2002, the F.B.I.'s investigation of Murder Inc's relationship to former drug dealer Kenneth \"Supreme\" McGriff, and a shooting incident at the offices of Violator Management. Furthermore, he made more headlines when he was jailed on New Year's Eve 2002 for gun possession. The media recounted his life story ad nauseam, particularly his storied brush with death -- and not just the expected media outlets like MTV -- even such unlikely mainstream publications as The New York Times ran feature stories (\"Amid Much Anticipation, a Rapper Makes a Debut\"). By the time Get Rich finally streeted on February 6, 2003, 50 Cent had become the most discussed figure in the music industry, and bootlegged or not, his initial sales figures reflected this (a record-breaking 872,000 units moved in five days, the best-selling debut album since SoundScan started its tracking system in May 1991), as did his omnipresence in the media. Late in the year, following another round of popular hits, \"21 Questions\" (which charted number one on the Hot 100) and \"P.I.M.P.\" (number three), 50 Cent made his group debut with G-Unit, Beg for Mercy. The album charted at number two and spawned a couple Top 15 hits, \"Stunt 101\" and \"Wanna Get to Know You.\" In 2004, 50 Cent stayed on the sidelines for the most part as G-Unit affiliates Lloyd Banks and Young Buck released popular solo albums. Another G-Unit affiliate, the Game, released his debut in January 2005, and it proved the most successful among these solo spin-offs, in particular the singles \"How We Do\" and \"Love It or Hate It,\" both Top Five hits that prominently featured 50 Cent. As these singles were riding high on the charts, however, 50 Cent and the Game were feuding, and the latter was acrimoniously booted out of G-Unit. There were also feuds with Fat Joe and Jadakiss (instigated by the song \"Piggy Bank\") during the run-up to the March 2005 release of The Massacre, 50 Cent's second album. Nearly as popular as Get Rich or Die Tryin', The Massacre debuted at number one, sold millions (over ten million worldwide), and spawned a series of smash hits (\"Disco Inferno,\" \"Candy Shop,\" \"Just a Lil Bit\").
By this point in time, 50 Cent's fame overshadowed his music, thereby predicating \"street\" credibility issues that would haunt him in the years to follow. For instance, the marketing rollout of The Massacre carried over into ventures such as the video game 50 Cent: Bulletproof, the semi-autobiographical film Get Rich or Die Tryin', and the soundtrack to that film -- all released in 2005, along with other product. The fallout from 50 Cent's overexposure was evident via the singles from the film soundtrack (\"Hustler's Ambition,\" \"Window Shopper,\" \"Best Friend,\" \"Have a Party\"), which failed to gain much traction in the marketplace, charting modestly relative to past singles. The next round of G-Unit solo releases (Tony Yayo's Thoughts of a Predicate Felon, 2005; Mobb Deep's Blood Money, 2005; Lloyd Banks' Rotten Apple, 2006; Young Buck's Buck the World, 2007) didn't perform commercially well, either, and it's wasn't entirely surprising when plans for another, Olivia's Behind Closed Doors, were shelved. The grim outlook didn't bode well for 50 Cent's next album, which was pushed back repeatedly and retitled a couple times. The final title, Curtis, was inspired by yet another feud, this one with Cam'ron, who taunted 50 Cent, somewhat oddly, by addressing him by his born name. After a pair of lead singles, \"Straight to the Bank\" and \"Amusement Park,\" failed to connect in the marketplace, Curtis was reworked one last time and pushed back from a summer release date to a fall one (i.e., the memorable date September 11, which -- to the glee of industry observers -- pitted the album against Kanye West's Graduation). A second round of singles, \"I Get Money\" and \"Ayo Technology,\" was released in the latter half of the summer, while the video for a fifth single, \"Follow My Lead,\" was leaked to the Internet -- to the frustration of 50 Cent, who reportedly cursed out Interscope for endangering the commercial prospects of his album -- over a month before street date. ~ Jason Birchmeier",
        "-index": "1",
        "-viewCount": "3",
        "-lastViewedAt": "1463334133",
        "-thumb": "/library/metadata/4123/thumb/1464508335",
        "-art": "/library/metadata/4123/art/1464508335",
        "-addedAt": "1451589357",
        "-updatedAt": "1464508335",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4116",
        "-key": "/library/metadata/4116/children",
        "-type": "artist",
        "-title": "A$AP Rocky",
        "-summary": "Rakim Mayers (born October 3, 1987 in Harlem, New York NY, United States), better known by his stage name ASAP Rocky (stylized as A$AP Rocky), is an American rapper, director, and member of the New York based Hip-Hop collective ASAP Mob. ASAP Rocky gained recognition among the hip hop community in 2011 with his first mixtape LIVE.LOVE.A$AP. He released his first album 'Long.Live.A$AP'  in 2013, and his second album 'AT.LONG.LAST.A$AP' was released on May 26, 2015. Both albums debuted at number one on the Billboard 200. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1458766808",
        "-thumb": "/library/metadata/4116/thumb/1464508332",
        "-art": "/library/metadata/4116/art/1464508332",
        "-addedAt": "1451589352",
        "-updatedAt": "1464508332",
        "Genre": { "-tag": "Rock" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2679",
        "-key": "/library/metadata/2679/children",
        "-type": "artist",
        "-title": "Adele",
        "-summary": "When the U.K. press began dubbing Adele \"the next Amy Winehouse\" in late 2007, the hype didn't touch upon the heavy singer/songwriter influence found in the Londoner's music. Influenced by Suzanne Vega as much as Jill Scott, Adele first made an impression in 2006 when she toured as an opening act for Jack Penate. She had graduated to headlining status by the end of 2007, thanks to BBC Radio 1 playing her single \"Daydreamer\"; another song, \"Hometown Glory,\" was also released as a single on Jamie T.'s label, Pacemaker. An appearance alongside Paul McCartney and Björk on the BBC 2 television show Later with Jools Holland came next, and a recording contract with XL Recordings was finalized soon after. Early 2008 brought similar luck as Adele found herself atop the BBC's new music talent list, which was compiled from the votes of 150 music critics. That same January, XL issued a new single, \"Chasing Pavements,\" along with her debut album, 19. The title reflected Adele's age at the time of the album's release, and its popularity resulted in the release of several bonus editions throughout the year. Also in 2009, Adele won Grammy Awards for Best New Artist and Best Female Pop Vocal Performance.
Her sophomore album, 21, featuring the gospel and disco-infused single \"Rolling in the Deep,\" was released in February of 2011. The album proved to be both a critical and commercial success, becoming one of the longest-running number one albums in history and spending over 18 weeks at the top spot. The glow of 21's success was dimmed somewhat when Adele was forced to cancel her tour after suffering a hemorrhage on her vocal chords. She underwent surgery for the hemorrhage in November of 2011. That same month, she released the concert CD/DVD Live at the Royal Albert Hall. Both Adele and 21 received many end-of-year honors, and in February 2012, as album sales began to creep closer to ten million copies, she won six major Grammy awards, one of the few artists in history to accomplish the feat in one night. In October 2012, Adele announced that she had recorded the theme to the 23rd Bond film, Skyfall. Produced by Paul Epworth and recorded at the prestigious Abbey Road Studios, the single entered the top 10 of both the UK singles chart and the Billboard Hot 100 on release. By early 2013, 21 had registered sales of over 25 million copies. ~ David Jeffries",
        "-index": "1",
        "-viewCount": "4",
        "-lastViewedAt": "1463335209",
        "-thumb": "/library/metadata/2679/thumb/1464508333",
        "-art": "/library/metadata/2679/art/1464508333",
        "-addedAt": "1448305929",
        "-updatedAt": "1464508333",
        "Genre": { "-tag": "Pop" },
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "1948",
        "-key": "/library/metadata/1948/children",
        "-type": "artist",
        "-title": "afx",
        "-summary": "AFX is a project of Richard D. James, AKA Aphex Twin.  Music released under the AFX moniker tends toward a more acid-techno sound than James's other work.",
        "-index": "1",
        "-viewCount": "3",
        "-lastViewedAt": "1454821881",
        "-thumb": "/library/metadata/1948/thumb/1464508337",
        "-art": "/library/metadata/1948/art/1464508337",
        "-addedAt": "1448988936",
        "-updatedAt": "1464508337",
        "Genre": { "-tag": "Afx" }
      },
      {
        "-ratingKey": "2639",
        "-key": "/library/metadata/2639/children",
        "-type": "artist",
        "-title": "Alexandre Desplat",
        "-summary": "Alexandre Michel Gérard Desplat (born 23 August 1961 in Paris, France) is a French film score composer. Notably, he has received six Academy Award nominations, six BAFTA nominations, five Golden Globe nominations, five Grammy nominations and six César nominations, winning a Golden Globe for his work on \"The Painted Veil\" (2006), a Grammy for his work on \"The King's Speech\" (2011) and a César for his work on \"De battre mon cœur s'est arrêté\" (2006) and \"The Ghost Writer\" (2011). In 2011, Desplat won his first British Academy Film Award for his score for \"The King's Speech\".",
        "-index": "1",
        "-viewCount": "50",
        "-lastViewedAt": "1463343818",
        "-thumb": "/library/metadata/2639/thumb/1464508340",
        "-art": "/library/metadata/2639/art/1464508340",
        "-addedAt": "1399656866",
        "-updatedAt": "1464508340",
        "Genre": { "-tag": "Soundtrack" }
      },
      {
        "-ratingKey": "4120",
        "-key": "/library/metadata/4120/children",
        "-type": "artist",
        "-title": "Alt-J",
        "-summary": "English indie rockers Alt-J, named for the triangle that appears when pressing \"Alt\" and \"J\" on a Mac, formed in 2008 under the moniker FILMS. The quartet members, all of whom met at Leeds University, spent two years rehearsing before inking a deal with Infectious Records in 2011. The group's signature blend of layered, folk-inflected dub-pop and soaring alternative rock, which has been compared to everyone from the Wild Beasts and Hot Chip to Coldplay, was first heard on the 2012 singles \"Matilda\" and \"Fitzpleasure.\" The group's full-length studio debut, An Awesome Wave, arrived later that year. ~ James Christopher Monger",
        "-index": "1",
        "-viewCount": "45",
        "-lastViewedAt": "1459299606",
        "-thumb": "/library/metadata/4120/thumb/1464508347",
        "-art": "/library/metadata/4120/art/1464508347",
        "-addedAt": "1451589354",
        "-updatedAt": "1464508347",
        "Genre": [
          { "-tag": "Sodwee.com" },
          { "-tag": "Misc" }
        ],
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "2625",
        "-key": "/library/metadata/2625/children",
        "-type": "artist",
        "-title": "Arctic Monkeys",
        "-summary": "Arctic Monkeys are an indie rock band formed in Sheffield, South Yorkshire, England in 2002 after meeting at Stocksbridge High School. The band consists of Alex Turner (vocals, guitar), Jamie Cook (guitar), Nick O'Malley (backing vocals, bass) and Matt Helders (drums, vocals). Founding bassist Andy Nicholson left in 2006.",
        "-index": "1",
        "-viewCount": "13",
        "-lastViewedAt": "1457751560",
        "-thumb": "/library/metadata/2625/thumb/1464508345",
        "-art": "/library/metadata/2625/art/1464508345",
        "-addedAt": "1398223321",
        "-updatedAt": "1464508345",
        "Genre": { "-tag": "Alternative" },
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "4113",
        "-key": "/library/metadata/4113/children",
        "-type": "artist",
        "-title": "Big K.R.I.T.",
        "-summary": "Justin Scott (born August 26, 1986), better known by his stage name Big K.R.I.T., is an American hip hop musician and record producer from Meridian, Mississippi. K.R.I.T. is an acronym, meaning King Remembered In Time. K.R.I.T. first came into the hip hop scene in 2005 with the release of his two mixtapes, See Me On Top and See Me On Top II.",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1463861099",
        "-thumb": "/library/metadata/4113/thumb/1464508336",
        "-art": "/library/metadata/4113/art/1464508336",
        "-addedAt": "1451589351",
        "-updatedAt": "1464508336",
        "Genre": [
          { "-tag": "Rap" },
          { "-tag": "Hip Hop" }
        ]
      },
      {
        "-ratingKey": "2574",
        "-key": "/library/metadata/2574/children",
        "-type": "artist",
        "-title": "Björk",
        "-titleSort": "Bjork",
        "-summary": "Björk first came to prominence as one of the lead vocalists of the avant pop Icelandic sextet the Sugarcubes, but when she launched a solo career after the group's 1992 demise, she quickly eclipsed her old band's popularity. Instead of following in the Sugarcubes' arty guitar rock pretensions, Björk immersed herself in dance and club culture, working with many of the biggest names in the genre, including Nellee Hooper, Underworld, and Tricky. Debut, her first solo effort (except for an Icelandic-only smash released when she was just 11 years old), not only established her new artistic direction, but it became an international hit, making her one of the '90s most unlikely stars.
Though the title of Debut implied that it was Björk's first-ever solo project, she had actually been a professional vocalist since she was a child. When she was in elementary school in Reykjavik, she studied classical piano and, eventually, her teachers submitted a tape of her singing Tina Charles' \"I Love to Love\" to Iceland's Radio One. After \"I Love to Love\" was aired, a record label called Falkkin offered Björk a record contract. At the age of 11, her eponymous first album was released; the record contained covers of several pop songs, including the Beatles' \"Fool on the Hill,\" and boasted artwork from her mother and guitar work from her stepfather. Björk became a hit within Iceland and was not released in any other country.
Björk's musical tastes were changed by the punk revolution of the late '70s; in 1979, she formed a post-punk group called Exodus and, in the following year, she sang in Jam 80. In 1981, Björk and Exodus bassist Jakob Magnusson formed Tappi Tikarrass, which released an EP, Bitid Fast I Vitid, on Spor later that year; it was followed by the full-length Miranda in 1983. Following Tappi Tikarrass, she formed the goth-tinged post-punk group KUKL with Einar Orn Benediktsson. KUKL released two albums, The Eye (1984) and Holidays in Europe (1986), on Crass Records before the band metamorphosed into the Sugarcubes in the summer of 1986.
The Sugarcubes became one of the rare Icelandic bands to break out of their native country when their debut album, Life's Too Good, became a British and American hit in 1988. For the next four years, the group maintained a successful cult following in the U.K. and the U.S. while they were stars within Iceland. During 1990, Björk recorded a set of jazz standards and originals with an Icelandic bebop group called Trio Gudmundar Ingolfssonar. The album, Gling-Gló, was released only in Iceland. By 1992, tensions between Björk and Einar had grown substantially, which resulted in the band splitting apart.
Following the breakup of the group, Björk moved to London, where she began pursuing a dance-oriented solo career. The previous year, she had sung on 808 State's \"Ooops,\" which sparked her interest in club and house music. Björk struck up a working relationship with Nellee Hooper, a producer who had formerly worked with Soul II Soul and Massive Attack. The first result of their partnership was \"Human Behaviour,\" which was released in June of 1993. \"Human Behaviour\" became a Top 40 hit in the U.K., setting the stage for the surprising number three debut of the full-length album, Debut. Throughout 1993, Björk had hit U.K. singles -- including \"Venus as a Boy,\" \"Big Time Sensuality,\" and the non-LP \"Play Dead,\" a collaboration with David Arnold taken from the film Young Americans -- as well as modern rock radio hits in the U.S., and in both countries she earned rave reviews. At the end of the year, NME magazine named Debut the album of the year, while she won International Female Solo Artist and Newcomer at the BRIT Awards; Debut went gold in the U.S. and platinum in the U.K.
During 1994, Björk was relatively quiet as she recorded her second album with Nellee Hooper, Tricky, 808 State's Graham Massey, and Howie B of Mo' Wax Records; she also released a remix EP, co-wrote the title track for Madonna's Bedtime Stories, and performed on MTV Unplugged that same year. \"Army of Me,\" the first single from Björk's forthcoming album, was released as a teaser single in the spring of 1995; it debuted at number ten in the U.K. and became a moderate alternative rock hit in the U.S. Post, her second album, was released in June of 1995 to positive reviews; it peaked at number two in the U.K. and number 32 in the U.S. Post matched its predecessor in terms of sales and praise, going gold in the U.S. and helping her earn her second BRIT Award for Best International Female Artist. Post yielded the British hit singles \"Isobel\" (number 23), \"It's Oh So Quiet\" (number four), and \"Hyperballad\" (number eight), yet her singles failed to make much headway on American radio or MTV. Late in 1996, Björk released Telegram, an album comprised of radical remixes of the entire Post album, in the U.K.; Telegram was released in America in January 1997.
Homogenic, her most experimental studio effort to date, followed later that same year and spawned many remix releases in the next few years to follow. In the spring of 2000, she was named Best Actress by jurors at the Cannes Film Festival for her work in Lars Von Trier's Palme d'Or-winning Dancer in the Dark. Selmasongs, her score for the film, reunited Björk with her Homogenic collaborator Mark Bell and arrived in the fall of 2000, just in time for Dancer in the Dark's U.S. release. The full-length follow-up, Vespertine, was released one year later. She released a Greatest Hits collection and the Family Tree box set late in 2002. After performing a few dates in 2003, Björk geared up for a busy 2004, which included the release of her all-vocals and vocal samples-based album Medúlla and a performance of one of its songs, \"Oceania,\" at the 2004 Summer Olympics in Athens, Greece.
The soundtrack to Drawing Restraint 9, a film by multimedia artist Matthew Barney, arrived in 2005 and also featured contributions from Will Oldham. Released in 2007, Volta returned to the more playful, percussive side of Björk's music and included collaborations with Timbaland, Toumani Diabaté, Antony Hegarty, and an all-female Icelandic choir. Her tour supporting the album was a lavish affair, as chronicled in the 2009 set Voltaic, which was released in sets ranging from a CD/DVD to a limited multi-disc and vinyl edition. While she was touring the world in support of Volta, Björk began work on her most ambitious project to date: Biophilia, an interactive exploration of humanity's relationships to sound and the universe that would also educate listeners/viewers about music theory and science. Initially envisioned as a musical house, then an IMAX film directed by Michel Gondry, Biophilia's final form -- which took shape with the help of engineers, scientists, and video game designers -- was as a suite of apps for the iPad and iPhone. The album, which was also released on CD, arrived in October 2011. ~ Stephen Thomas Erlewine",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1463335704",
        "-thumb": "/library/metadata/2574/thumb/1464508430",
        "-art": "/library/metadata/2574/art/1464508430",
        "-addedAt": "1422216777",
        "-updatedAt": "1464508430",
        "Genre": { "-tag": "Indie" },
        "Country": { "-tag": "Iceland" }
      },
      {
        "-ratingKey": "4110",
        "-key": "/library/metadata/4110/children",
        "-type": "artist",
        "-title": "Bonobo",
        "-summary": "Simon Green AKA Bonobo's first album - 2000's 'Animal Magic' - was released via Tru Thoughts before being picked up by Ninja Tune. It announced him as a serious talent; able to bring a musician's edge to electronic music, with all the freedom that skill allowed. His subsequent albums for Ninja, Dial M for Monkey and Days to Come, developed his sensibility, won him fans across the globe, and saw him develop his live show into a mesmeric re-working of his records.",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1463335951",
        "-thumb": "/library/metadata/4110/thumb/1464508355",
        "-art": "/library/metadata/4110/art/1464508355",
        "-addedAt": "1451589349",
        "-updatedAt": "1464508355",
        "Genre": { "-tag": "Electronic" },
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "2545",
        "-key": "/library/metadata/2545/children",
        "-type": "artist",
        "-title": "CHVRCHES",
        "-summary": "Spelling their name with a \"v\" instead of a \"u\" to differentiate themselves in Internet searches, Glasgow's frosty electro-pop trio Chvrches feature singer Lauren Mayberry and keyboardists/vocalists Iain Cook and Martin Doherty. Mayberry, who previously played with the band Blue Sky Archives and holds a law degree as well as a master's degree in journalism, began working with Cook, a former member of Aerogramme and a film and television music composer, and Doherty, a touring member of the Twilight Sad, when they asked her to sing on some demos they were recording. The sessions went so well that the trio christened itself Chvrches and began writing songs inspired by Prince, Depeche Mode, and Kate Bush. Two of these songs, \"The Mother We Share\" and \"Lies,\" earned online buzz and led to the band scoring the opening slot on Passion Pit's 2012 U.K. tour. Late that year, Chvrches were among the acts selected for the BBC's Sound of 2013, ultimately finishing fifth. The trio began 2013 by playing a few North American dates and recording its debut album in Cook's basement studio. The Bones of What You Believe appeared in September of that year. ~ Heather Phares",
        "-index": "1",
        "-viewCount": "73",
        "-lastViewedAt": "1454820359",
        "-thumb": "/library/metadata/2545/thumb/1464508345",
        "-art": "/library/metadata/2545/art/1464508345",
        "-addedAt": "1378584247",
        "-updatedAt": "1464508345",
        "Genre": [
          { "-tag": "Pop" },
          { "-tag": "Electronic" }
        ],
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "4081",
        "-key": "/library/metadata/4081/children",
        "-type": "artist",
        "-title": "D.P.",
        "-summary": "D.P. (Danny Perez) is hip-hop singer/songwriter from Gainesville, FL. Current releases included Bar Tab Blues (2009), fortyeighthours (2009). D.P. is currently in the studio working on his next full-length recording.",
        "-index": "1",
        "-thumb": "/library/metadata/4081/thumb/1464508349",
        "-addedAt": "1451589340",
        "-updatedAt": "1464508349",
        "Genre": { "-tag": "Blues" }
      },
      {
        "-ratingKey": "2525",
        "-key": "/library/metadata/2525/children",
        "-type": "artist",
        "-title": "Daft Punk",
        "-summary": "In similar company with new-school French progressive dance artists such as Motorbass, Air, Cassius, and Dimitri from Paris, Parisian duo Daft Punk quickly rose to acclaim by adapting a love for first-wave acid house and techno to their younger roots in pop, indie rock, and hip-hop. The combined talents of DJs Guy-Manuel de Homem-Christo and Thomas Bangalter, the pair's first projects together included Darling, a voiceless indie cover band; their current recording name derives from a review in U.K. music weekly Melody Maker of a compilation tape Darling were featured on, released by Krautrock revivalists Stereolab (their lo-fi D.I.Y. cover of a Beach Boys song was derided as \"daft punk\"). Subsequently ditching the almost inevitable creative cul-de-sac of rock for the more appealing rush of the dancefloor, the pair released their debut single, \"The New Wave,\" in 1993 on the celebrated Soma label. Instantly hailed by the dance music press as the work of a new breed of house innovators, the single was followed by \"Da Funk,\" the band's first true hit (the record sold 30,000 copies worldwide and saw thorough rinsings by everyone from Kris Needs to the Chemical Brothers).
Although the group had only released a trio of singles (\"The New Wave\" and \"Da Funk,\" as well as the 1996 limited pressing of \"Musique\"), in early 1996 Daft Punk were the subject of a minor bidding war. The group eventually signed with Virgin, with its first long-player, Homework, appearing early the following year (a brief preview of the album, \"Musique,\" was also featured on the Virgin compilation Wipeout XL next to tracks from Photek, Future Sound of London, the Chemical Brothers, and Source Direct). As with the earlier singles, the group's sound is a brazen, dancefloor-oriented blend of progressive house, funk, electro, and techno, with sprinklings of hip-hop-styled breakbeats and excessive, crowd-firing samples similar to other anthemic dance-fusion acts such as the Chemical Brothers and Monkey Mafia. In addition to his role in Daft Punk, Bangalter operates the Roulé label and has recorded under his own name (the underground smash \"Trax on da Rocks\") as well as Stardust (the huge club/commercial hit \"Music Sounds Better with You\").
After four long years of fans eagerly awaiting a follow-up to their brilliant debut, Daft Punk finally issued Discovery in March 2001. The live record Alive 1997 followed at the end of the year, and a by-now predictable four-year wait preceded the release of Human After All in early 2005. One year later, Daft Punk released a compilation, Musique, Vol. 1: 1993-2005, and in 2007 their second live record, Alive 2007, arrived. The album and its single \"Harder, Better, Faster, Stronger\" won Grammy Awards early in 2009; shortly after, it was announced that the duo would compose the soundtrack to Tron: Legacy, the sequel to the 1982 classic sci-fi film Tron. Daft Punk's music for the movie was released in November 2010, shortly before the film -- which featured the group in a cameo -- arrived in theaters. Early in 2013, Daft Punk announced that they planned to have a new album released by May of that year. That March, the duo announced the album's title, Random Access Memories, and launched an extensive press campaign that featured snippets of the album's lead single, \"Get Lucky,\" and interviews with some of their collaborators, which included Nile Rodgers, Paul Williams, Giorgio Moroder, and Panda Bear. The single was officially released in April, and Random Access Memories arrived in May. ~ Sean Cooper",
        "-index": "1",
        "-viewCount": "33",
        "-lastViewedAt": "1463337548",
        "-thumb": "/library/metadata/2525/thumb/1464508363",
        "-art": "/library/metadata/2525/art/1464508363",
        "-addedAt": "1368470138",
        "-updatedAt": "1464508363",
        "Genre": [
          { "-tag": "Other" },
          { "-tag": "Disco" }
        ],
        "Country": { "-tag": "France" }
      },
      {
        "-ratingKey": "1631",
        "-key": "/library/metadata/1631/children",
        "-type": "artist",
        "-title": "Disclosure",
        "-summary": "There is more than one artist with this name:",
        "-index": "1",
        "-viewCount": "11",
        "-lastViewedAt": "1454817527",
        "-thumb": "/library/metadata/1631/thumb/1464508350",
        "-art": "/library/metadata/1631/art/1464508350",
        "-addedAt": "1369991013",
        "-updatedAt": "1464508350",
        "Genre": { "-tag": "Electronic" },
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "4078",
        "-key": "/library/metadata/4078/children",
        "-type": "artist",
        "-title": "Dr. Dre",
        "-summary": "More than any other rapper, Dr. Dre was responsible for moving away from the avant-noise and political stance of Public Enemy and Boogie Down Productions as well as the party vibes of old-school rap. Instead, Dre pioneered gangsta rap and his own variation of the sound, G-funk. BDP's early albums were hardcore but cautionary tales of the criminal mind, but Dre's records with N.W.A. celebrated the hedonistic, amoralistic side of gang life. Dre was never much of a rapper -- his rhymes were simple and his delivery was slow and clumsy -- but as a producer, he was extraordinary. With N.W.A. he melded the noise collages of the Bomb Squad with funky rhythms. On his own, he reworked George Clinton's elastic funk into the self-styled G-funk, a slow-rolling variation that relied more on sound than content. When he left N.W.A. in 1992, he founded Death Row Records with Suge Knight, and the label quickly became the dominant force in mid-'90s hip-hop thanks to his debut, The Chronic. Soon, most rap records imitated its sound, and his productions for Snoop Doggy Dogg and Blackstreet were massive hits. For nearly four years, G-funk dominated hip-hop, and Dre had enough sense to abandon it and Death Row just before the whole empire collapsed in late 1996. Dre retaliated by forming a new company, Aftermath, and while it was initially slow getting started, his bold moves forward earned critical respect.
Dre (born Andre Young, February 18, 1965) became involved in hip-hop during the early '80s, performing at house parties and clubs with the World Class Wreckin' Cru around South Central Los Angeles and making a handful of recordings along the way. In 1986, he met Ice Cube, and the two rappers began writing songs for Ruthless Records, a label started by former drug pusher Eazy-E. Eazy tried to give one of the duo's songs, \"Boyz-n-the Hood,\" to HBO, a group signed to Ruthless. When the group refused, Eazy formed N.W.A. -- an acronym for Niggaz With Attitude -- with Dre and Cube, releasing their first album in 1987. A year later, N.W.A. delivered Straight Outta Compton, a vicious hardcore record that became an underground hit with virtually no support from radio, the press, or MTV. N.W.A. became notorious for their hardcore lyrics, especially those of \"Fuck tha Police,\" which resulted in the FBI sending a warning letter to Ruthless and its parent company, Priority, suggesting that the group should watch their step.
Most of the group's political threat left with Cube when he departed in late 1989 amid many financial disagreements. While Eazy appeared to be the undisputed leader following Cube's departure -- and he was certainly responsible for the group approaching near-parodic levels with their final pair of records -- the music was in Dre's hands. On both the 1990 EP 100 Miles and Runnin' and the 1991 album Efil4zaggin (\"Niggaz4life\" spelled backward), he created dense, funky sonic landscapes that were as responsible for keeping N.W.A. at the top of the charts as Eazy's comic-book lyrics. While the group was at the peak of their popularity in 1991, Dre began to make efforts to leave the crew, especially after he was charged with assaulting the host of a televised rap show in 1991. The following year, Dre left the group to form Death Row Records with Suge Knight. According to legend, Knight held N.W.A.'s manager at gunpoint and threatened to kill him if he refused to let Dre out of his contract.
Dre released his first solo single, \"Deep Cover,\" in the spring of 1992. Not only was the record the debut of his elastic G-funk sound, it also was the beginning of his collaboration with rapper Snoop Doggy Dogg. Dre discovered Snoop through his stepbrother Warren G, and he immediately began working with the rapper -- Snoop was on Dre's 1992 debut, The Chronic, as much as Dre himself. Thanks to the singles \"Nuthin' but a 'G' Thang,\" \"Dre Day,\" and \"Let Me Ride,\" The Chronic was a multi-platinum, Top Ten smash, and the entire world of hip-hop changed with it. For the next four years, it was virtually impossible to hear mainstream hip-hop that wasn't effected in some way by Dre and his patented G-funk. Not only did he produce Snoop's 1993 debut, Doggystyle, but he orchestrated several soundtracks, including Above the Rim and Murder Was the Case (both 1994), which functioned as samplers for his new artists and production techniques, and he helmed hit records such as Blackstreet's \"No Diggity,\" among others, including a hit reunion with Ice Cube, \"Natural Born Killaz.\" During this entire time, Dre released no new records, but he didn't need to -- all of Death Row was under his control, and most of his peers mimicked his techniques.
The Death Row dynasty held strong until the spring of 1996, when Dre grew frustrated with Knight's strong-arm techniques. At the time, Death Row was devoting itself to 2Pac's label debut, All Eyez on Me (which featured Dre on the breakthrough hit, \"California Love\"), and Snoop was busy recovering from his draining murder trial. Dre left the label in the summer of 1996 to form Aftermath, declaring gangsta rap dead. While he was subjected to endless taunts from his former Death Row colleagues, their sales slipped by 1997 and Knight was imprisoned on racketeering charges by the end of the year. Dre's first album for Aftermath, the various-artists collection Dr. Dre Presents...The Aftermath received considerable media attention, but the record didn't become a hit, despite the presence of his hit single, \"Been There Done That.\" Even though the album wasn't a success, the implosion of Death Row in 1997 proved that Dre's inclinations were correct at the time. Both 2001 and its companion instrumental version followed in 1999. ~ Stephen Thomas Erlewine",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1458766625",
        "-thumb": "/library/metadata/4078/thumb/1464508362",
        "-art": "/library/metadata/4078/art/1464508362",
        "-addedAt": "1451589337",
        "-updatedAt": "1464508362",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "1647",
        "-key": "/library/metadata/1647/children",
        "-type": "artist",
        "-title": "Drake",
        "-summary": "Sucks",
        "-index": "1",
        "-viewCount": "8",
        "-lastViewedAt": "1463338164",
        "-thumb": "/library/metadata/1647/thumb/1464508392",
        "-art": "/library/metadata/1647/art/1464508392",
        "-addedAt": "1423802906",
        "-updatedAt": "1464508392",
        "Genre": [
          { "-tag": "Hip-Hop" },
          { "-tag": "Rap" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4075",
        "-key": "/library/metadata/4075/children",
        "-type": "artist",
        "-title": "Ed Sheeran",
        "-summary": "Ed Sheeran (born 17 February 1991) is a singer songwriter currently signed under Atlantic (WMG). Sheeran was born in Halifax, West Yorkshire before moving to Framlingham, Suffolk. In his time in Suffolk, he was known to have flourished as a hidden talent when it came to music. He learned guitar at a very young age, and began writing songs during his time at Thomas Mills High School in Framlingham. By the time Sheeran had left school, he was already certain that music was going to play a major part in his life, and therefore studied at Access To Music in Norwich before moving to London which improved his chances of getting gigs.",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1454259239",
        "-thumb": "/library/metadata/4075/thumb/1464508362",
        "-art": "/library/metadata/4075/art/1464508362",
        "-addedAt": "1451589336",
        "-updatedAt": "1464508362",
        "Genre": [
          { "-tag": "Pop" },
          { "-tag": "House" }
        ]
      },
      {
        "-ratingKey": "4070",
        "-key": "/library/metadata/4070/children",
        "-type": "artist",
        "-title": "Explosions In The Sky",
        "-summary": "With a reputation for a scathingly intense live performance and a quickly sold-out CD-R demo, How Strange, Innocence, which was later reissued in 2005, Explosions in the Sky was touted early on in their career as the next phenomenon in moody and dynamic instrumental indie rock à la Mogwai and Godspeed You Black Emperor! The quartet of Texas kids, made up of Mark Smith and Munaf Rayani on guitars, Michael James on bass, and Christopher Hrasky on drums, was signed for its first release on Temporary Residence Limited after half a listen to their demo, which was submitted by the American Analog Set with a brief note saying \"This totally f*cking destroys.\" From that, they released their first six-song album, Those Who Tell the Truth, in the latter half of 2001. After a new record, 2003's contemplative The Earth Is Not a Cold Dead Place, and the 2005 re-release, Explosions in the Sky, who had by this time garnered a dedicated fan base, came out with All of a Sudden I Miss Everyone in 2007. The band also found some exposure by lending their emotive songwriting to the soundtracks of both the film and television series Friday Night Lights, creating a stirring soundtrack to the drama set in their home state of Texas. In 2011, the quartet got back to writing albums, releasing Take Care, Take Care, Take Care on Temporary Residence. Two years later, the band teamed up with fellow Austin resident David Wingo to do the score for David Gordon Green's film, Prince Avalanche.  ~ Blake Butler",
        "-index": "1",
        "-thumb": "/library/metadata/4070/thumb/1464508368",
        "-art": "/library/metadata/4070/art/1464508368",
        "-addedAt": "1451589332",
        "-updatedAt": "1464508368",
        "Genre": { "-tag": "Rock" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4067",
        "-key": "/library/metadata/4067/children",
        "-type": "artist",
        "-title": "Florida Georgia Line",
        "-summary": "Florida Georgia Line is a duo comprised of members Tyler Hubbard (from Monroe, Georgia) and Brian Kelley (from Ormond Beach, Florida). Their sound combines electrifying, hard-driving rock with honest, expressive lyrics. The Cruise Songfacts explains that both Hubbard and Kelley began playing guitar individually while they were in high school before meeting at Nashville’s Belmont University. They began writing songs together between classes and soon found themselves playing local clubs, quickly building a fan-base. Hubbard and Kelley signed a publishing/production/management deal with Craig Wiseman's Big Loud Mountain record label in December 2011 and released their first five-song E.P., It‘z Just What We Do, the following May. \"Cruise\" is their first single from the collection.
For more details on the biography of Florida Georgia Line, visit www.floridageorgialine.com Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1452365889",
        "-thumb": "/library/metadata/4067/thumb/1464508367",
        "-art": "/library/metadata/4067/art/1464508367",
        "-addedAt": "1451589331",
        "-updatedAt": "1464508367",
        "Genre": { "-tag": "Country" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2509",
        "-key": "/library/metadata/2509/children",
        "-type": "artist",
        "-title": "Flume",
        "-summary": "Flume is an electronic music project, created by Harley Streten from Sydney, Australia. Streten was discovered and signed by Future Classic in 2011, after submitting the tracks \"Sleepless\", \"Over You\" and \"Paper Thin\" in an original artists competition managed by the Australian record company. Nathan McLay, an employee of Future Classic and now Flume's manager, assisted with the release of his first EP titled Sleepless , which contained the three original tracks.",
        "-index": "1",
        "-viewCount": "101",
        "-lastViewedAt": "1463338860",
        "-thumb": "/library/metadata/2509/thumb/1464508373",
        "-art": "/library/metadata/2509/art/1464508373",
        "-addedAt": "1351839113",
        "-updatedAt": "1464508373",
        "Genre": { "-tag": "Electronic" },
        "Country": { "-tag": "Australia" }
      },
      {
        "-ratingKey": "4064",
        "-key": "/library/metadata/4064/children",
        "-type": "artist",
        "-title": "Flux Pavilion",
        "-summary": "Hitting the scene in early 2009 out of Towcester, UK, Joshua Steele (better known as Flux Pavilion) secured himself a solid stance in the dubstep world. His blend of hard smashing rhythms and manic basslines have certainly gained him an audience. Also as a musician he has incorporated his singing and instrumental talent into his tracks. Well known for his high energy sets, he is being booked home and abroad for his unique take on the dubstep sound. With exclusive plays from the likes of Rusko, Caspa, N-Type, Hatcha, Plastician and all the big names his tunes have been blasted all over the world. After performances alongside N-Type on Rinse and Hatcha on KISS FM, Flux Pavilion is certainly making waves in the dubstep scene and everywhere else. With big plans for Circus Records (Swan-E's dubstep label) there is no doubt that Flux will continue rise to stardom doing the thing he knows best; smashing dancefloors from here to the moon.",
        "-index": "1",
        "-thumb": "/library/metadata/4064/thumb/1464508405",
        "-art": "/library/metadata/4064/art/1464508405",
        "-addedAt": "1451589330",
        "-updatedAt": "1464508405",
        "Genre": [
          { "-tag": "Electronic" },
          { "-tag": "World" }
        ],
        "Country": { "-tag": "United Kingdom" }
      },
      {
        "-ratingKey": "2333",
        "-key": "/library/metadata/2333/children",
        "-type": "artist",
        "-title": "Flying Lotus",
        "-summary": "Experimental electronic music producer Flying Lotus, born Steven Ellison, is a grandson of songwriter Marilyn McLeod (the co-writer of Diana Ross' \"Love Hangover\"), as well as a great-nephew of pianist Alice Coltrane, and therefore a cousin of saxophonist Ravi Coltrane. Ellison made beats for the Cartoon Network's Adult Swim network before releasing his debut full-length, 1983, which resembled the work of fellow avant-garde hip-hop producers Madlib, J Dilla, and Ammoncontact on Plug Research in 2006. Following the six-song EP Reset, he released his second full-length, Los Angeles, on Warp in 2008. A three-part series of satellite EPs consisting of remixes and additional productions trailed through the next year. Cosmogramma, his third and most complex album, was issued on the same label in 2010, while the relatively pared-down Until the Quiet Comes followed in 2012. His additional production and remix work is scattered across dozens of releases on revered labels such as Tectonic, Hyperdub, Ghostly International, and Ninja Tune -- the last of which is the distributor of his Brainfeeder label, home to the likes of the Gaslamp Killer, Austin Peralta, Martyn, and Thundercat. ~ Marisa Brown",
        "-index": "1",
        "-thumb": "/library/metadata/2333/thumb/1464508416",
        "-art": "/library/metadata/2333/art/1464508416",
        "-addedAt": "1433946648",
        "-updatedAt": "1464508416",
        "Genre": { "-tag": "Electronic" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4620",
        "-key": "/library/metadata/4620/children",
        "-type": "artist",
        "-title": "fun.",
        "-summary": "Following the Format's breakup in 2008, frontman Nate Ruess took his songwriting skills to Steel Train's Jack Antonoff and Anathallo's Andrew Dost, both of whom shared a similar affinity for vintage pop music and quirky, melodic hooks. The trio began a series of collaborations in Antonoff's parents' living room and soon enlisted the help of producer Steven McDonald, who recorded their work and handled bass duties. After enlisting the help of former Jellyfish keyboardist Robert Joseph Manning, Jr., who arranged several tracks, the bandmates completed work on their first record. Dubbing themselves Fun., the group introduced their Queen and ELO-influenced big pop sound in 2009 with the debut album Aim and Ignite. In 2012, Fun. returned with its sophomore effort, Some Nights. The album was produced by Jeff Bhasker, who worked on Kanye West's My Beautiful Dark Twisted Fantasy. The album drew much inspiration from hip-hop, and West in particular, while staying true to their roots and blowing their sound up to impressively large proportions. The record's first single, \"We Are Young,\" featured vocals by Janelle Monáe and reached number three on the Billboard Hot 100. ~ Andrew Leahey",
        "-index": "1",
        "-thumb": "/library/metadata/4620/thumb/1464508412",
        "-art": "/library/metadata/4620/art/1464508412",
        "-addedAt": "1451589644",
        "-updatedAt": "1464508412",
        "Genre": [
          { "-tag": "Pop" },
          { "-tag": "Rock" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2102",
        "-key": "/library/metadata/2102/children",
        "-type": "artist",
        "-title": "Future Islands",
        "-summary": "Future Islands is a new wave synthpop band based in Baltimore, Maryland, USA.  The band is composed of Gerrit Welmers (keyboards and programming), William Cashion (bass, acoustic and electric guitars), and Samuel T. Herring (lyrics and vocals).  Their sound has been described as \"terse yet passionate music wrought from a stripped back palette,\" where \"Gerrit Welmers' synthesizer melodies tumble across the austere wilderness of William Cashion's post-punk bass pulse, driven ever forward by ecstatic electronic rhythms\".",
        "-index": "1",
        "-viewCount": "14",
        "-lastViewedAt": "1458685376",
        "-thumb": "/library/metadata/2102/thumb/1464508383",
        "-addedAt": "1356653138",
        "-updatedAt": "1464508383",
        "Genre": { "-tag": "Alternative" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4601",
        "-key": "/library/metadata/4601/children",
        "-type": "artist",
        "-title": "Geto Boys",
        "-summary": "The Geto Boys (originally spelled \"Ghetto Boys\") are a Gangsta Rap group from Houston, Texas, USA, active since 1986, consisting of Scarface, Willie D and Bushwick Bill. They are known for ultra-violent lyrical content and socially conscious messages. Their 1990 album, The Geto Boys, had to switch distributors from Geffen to Giant Records due to controversy over the graphic portrayal of rape, necrophilia, and murder in the song \"Mind of a Lunatic.\" It was later released with alternate lyrics on iTunes and in their compilation CD, Uncut Dope. The Geto Boys (released by Rick Rubin's Def American Recordings, later re-named American Recordings) is actually a compilation, consisting mainly of ten tracks taken from their 1989 album Grip It! On That Other Level as well as two new songs and one song from their debut LP, Making Trouble.",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1458765667",
        "-thumb": "/library/metadata/4601/thumb/1464508421",
        "-art": "/library/metadata/4601/art/1464508421",
        "-addedAt": "1451589643",
        "-updatedAt": "1464508421",
        "Genre": [
          { "-tag": "Rap" },
          { "-tag": "Hip Hop" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2413",
        "-key": "/library/metadata/2413/children",
        "-type": "artist",
        "-title": "Grimes",
        "-summary": "Grimes is the name of more than one artists:",
        "-index": "1",
        "-viewCount": "19",
        "-lastViewedAt": "1454818607",
        "-thumb": "/library/metadata/2413/thumb/1464508431",
        "-art": "/library/metadata/2413/art/1464508431",
        "-addedAt": "1446938966",
        "-updatedAt": "1464508431",
        "Genre": [
          { "-tag": "Pop" },
          { "-tag": "Electronic" }
        ],
        "Country": { "-tag": "Canada" }
      },
      {
        "-ratingKey": "2362",
        "-key": "/library/metadata/2362/children",
        "-type": "artist",
        "-title": "Hermitude",
        "-summary": "Now residing in Sydney, Luke Dubs and Elgusto grew up in the Blue Mountains where they took up musical instruments at a young age. They’ve played together with Elgusto’s sister Aja in a funk/jazz group called Funk Injection since their early teens.",
        "-index": "1",
        "-viewCount": "6",
        "-lastViewedAt": "1463339434",
        "-thumb": "/library/metadata/2362/thumb/1464508405",
        "-art": "/library/metadata/2362/art/1464508405",
        "-addedAt": "1327267666",
        "-updatedAt": "1464508405",
        "Genre": { "-tag": "Hip-Hop" },
        "Country": { "-tag": "Australia" }
      },
      {
        "-ratingKey": "2342",
        "-key": "/library/metadata/2342/children",
        "-type": "artist",
        "-title": "Hippie Sabotage",
        "-summary": "Experimental Hip Hop producers from San Diego, California Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply",
        "-index": "1",
        "-viewCount": "41",
        "-lastViewedAt": "1463341329",
        "-thumb": "/library/metadata/2342/thumb/1464508385",
        "-addedAt": "1412786346",
        "-updatedAt": "1464508385",
        "Genre": { "-tag": "Electronica" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4596",
        "-key": "/library/metadata/4596/children",
        "-type": "artist",
        "-title": "Hoodie Allen",
        "-summary": "Make every word count. This has long been the mantra of Hoodie Allen, the New York based rapper and songwriter. With a penchant for candid storytelling and witty punchlines, Hoodie has always been an emcee who understood the importance of connecting with the audience through his lyrics. A purveyor of summertime anthems, Hoodie Allen has gained notable buzz on the internet for his unique genre-blending style, unafraid to sample from unconventional sources.",
        "-index": "1",
        "-lastViewedAt": "1458762935",
        "-thumb": "/library/metadata/4596/thumb/1464508408",
        "-art": "/library/metadata/4596/art/1464508408",
        "-addedAt": "1451589641",
        "-updatedAt": "1464508408",
        "Genre": { "-tag": "Rap" }
      },
      {
        "-ratingKey": "2319",
        "-key": "/library/metadata/2319/children",
        "-type": "artist",
        "-title": "J. Cole",
        "-summary": "Producer and MC J. Cole was the first artist to signed to Jay-Z’s Roc Nation label. Born in Germany but raised in North Carolina, Cole grew up with a mother who loved rock and folk while his father was a fan of hardcore hip-hop artists like 2Pac and Ice Cube. Graduating high school, his grades were good enough to earn a scholarship, but hip-hop had taken hold of his life and he had decided that N.Y.C. was where artists went to get signed. As such, he attended the city’s St. John's University on an academic scholarship. After numerous days standing outside Jay-Z’s office in hopes of giving him a demo, Cole finally ran into his idol, but the reception was well below chilly. He was shocked then when he received a call from the man weeks later, and even more shocked when he got a chance to contribute to Jay-Z’s 2009 effort The Blueprint 3. That same year he would release the mixtape The Warm Up while 2010 saw the Friday Night Lights mixtape appear, with Cole handling most of the production. A year later, Roc Nation released his official debut, Cole World: The Sideline Story, which debuted on top of the Billboard 200. Featuring the single \"Power Trip,\" Born Sinner followed in 2013 with guest appearances from Miguel, TLC, and Kendrick Lamar. ~ David Jeffries",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1463341541",
        "-thumb": "/library/metadata/2319/thumb/1464508438",
        "-art": "/library/metadata/2319/art/1464508438",
        "-addedAt": "1424275949",
        "-updatedAt": "1464508438",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "1678",
        "-key": "/library/metadata/1678/children",
        "-type": "artist",
        "-title": "Jay-Z",
        "-summary": "Embodying the rags-to-riches rap dream, Jay-Z pulled himself up by his bootstraps as a youth to eventually become the reigning rapper of New York City and, in turn, a major-label executive following his short-lived retirement from music-making. In the wake of his 1996 debut, Reasonable Doubt, Jay-Z's albums sold millions upon millions with each release, and his endless parade of hits made him omnipresent on urban radio and video television. He retained a strongly devoted fan base and challenged whatever rivals attempted to oust him from atop the rap game, sparring most memorably with Nas. Jay-Z and his Roc-a-Fella associates greatly influenced the industry and established many of the trends that pervaded during the late '90s and early 2000s. He consistently worked with the hottest producers of the day (Clark Kent, DJ Premier, Teddy Riley, Trackmasters, Erick Sermon, Timbaland, Swizz Beatz), and if they weren't hot at the time, they likely would be afterward (the Neptunes, Kanye West, Just Blaze, 9th Wonder). He similarly collaborated with the hottest rappers in the industry, everyone from East Coast contemporaries like the Notorious B.I.G. (\"Brooklyn's Finest\") and DMX (\"Cash, Money, Hoes\"), to the best rappers from the South (Ludacris, Missy Elliott) and the West Coast (Snoop Dogg, Too Short). After his self-declared retirement from rapping in 2003, he assumed the presidency of the seminal rap label Def Jam and, as an industry executive, embarked on another phase in his illustrious career.
Born in 1969 and raised in the rough Marcy Projects of Brooklyn, New York, Jay-Z underwent some tough times after his father left his mother before the young rapper was even a teen. Without a man in the house, he became a self-supportive youth, turning to the streets, where he soon made a name for himself as a fledging rapper. Known as \"Jazzy\" in his neighborhood, he soon shortened his nickname to Jay-Z and did all he could to break into the rap game. As he vividly discusses in his lyrics, Jay-Z also became a street hustler around this time, doing what needed to be done to make money. For a while, he ran around with Jaz-O, aka Big Jaz, a small-time New York rapper with a record deal but few sales. From Jaz he learned how to navigate through the rap industry and what moves to make. He also participated in the group Original Flavor for a short time. Jay-Z subsequently decided to make an untraditional decision and start his own label rather than sign with an established label as Jaz had done. Together with friends Damon Dash and Kareem \"Biggs\" Burke, he created Roc-a-Fella Records, a risky strategy for cutting out the middleman and making money for himself. Once he found a reputable distributor, Priority Records (and then later Def Jam), Jay-Z finally had everything in place, including a debut album, Reasonable Doubt (1996).
Though Reasonable Doubt only reached number 23 on Billboard's album chart, Jay-Z's debut eventually became recognized as an undisputed classic among fans, many of whom consider it his crowning achievement. Led by the hit single \"Ain't No Nigga,\" a duet featuring Foxy Brown, Reasonable Doubt slowly spread through New York; some listeners were drawn in because of big names like DJ Premier and the Notorious B.I.G., others by the gangsta motifs very much in style at the time, still others by Jay-Z himself. By the end of its steady run, Reasonable Doubt generated three more charting singles -- \"Can't Knock the Hustle,\" which featured Mary J. Blige on the hook; \"Dead Presidents,\" which featured a prominent sample of \"The World Is Yours,\" a 1994 hit by Nas, and \"Feelin' It\" -- and set the stage for Jay-Z's follow-up, In My Lifetime, Vol. 1 (1997).
Peaking at number three on the Billboard album chart, In My Lifetime sold much more strongly than its predecessor. The album boasted pop-crossover producers such as Puff Daddy and Teddy Riley, and singles such as \"Sunshine\" and \"The City Is Mine\" indeed showcased a newfound embrace of pop crossover. Yet there were still plenty of hard-hitting songs, such as \"Streets Is Watching\" and \"Rap Game/Crack Game\" to lace In My Lifetime with gangsta rap as well as pop crossover. Jay-Z's next album, Vol. 2: Hard Knock Life (1998), released a year after In My Lifetime, was laden with hit singles: \"Can I Get A...\" and \"Hard Knock Life (Ghetto Anthem)\" broke the Top 20 of the Billboard Hot 100, while \"Cash, Money, Hoes\" and \"Nigga What, Nigga Who\" also charted. Vol. 2: Hard Knock Life ended up winning a Grammy for Best Rap Album.
Like clockwork, Jay-Z returned a year later with another album, Vol. 3: Life and Times of S. Carter (1999), which topped the Billboard 200 and spawned two hits: \"Big Pimpin'\" and \"Do It Again (Put Ya Hands Up).\" The album was Jay-Z's most collaborative to date, featuring ten guest vocalists and a roll call of in-demand producers such as Dr. Dre and Timbaland. Jay-Z then scaled back a bit for Dynasty Roc la Familia (2000), his fifth album in as many years. The album showcased Roc-a-Fella's in-house rappers: Beanie Sigel guests on seven of the 16 tracks, Memphis Bleek guests on six, and both Amir and Freeway also make guest appearances. On Dynasty Roc la Familia, Jay-Z also began working with a few new producers: the Neptunes, Kanye West, and Just Blaze. The Neptunes-produced \"I Just Wanna Love U (Give It 2 Me)\" became a particularly huge hit single this go-round.
Jay-Z's next album, The Blueprint (2001), solidified his position atop the New York rap scene upon its release in September. Prior to the album's release, the rapper had caused a stir in New York following his headlining performance at Hot 97's Summer Jam 2001, where he debuted the song \"Takeover.\" The song features a harsh verse ridiculing Prodigy of Mobb Deep, and Jay-Z accentuated his verbal assault (including the lines \"You's a ballerina/I seen ya\") by showcasing gigantic photos of an adolescent Prodigy in a dance outfit. The version of \"Takeover\" that later appeared on The Blueprint includes a third verse, this one dissing Nas, who, in response to the Summer Jam performance, had called out Jay-Z, \"the fake king of New York,\" in a freestyle known as \"Stillmatic.\" As expected, \"Takeover\" ignited a sparring match with Nas, who responded with \"Ether.\" Jay-Z accordingly returned with a comeback, \"Super Ugly,\" where he rapped over the beats to Nas' \"Get Ur Self a...\" on the first verse and Dr. Dre's \"Bad Intentions\" on the second. The back-and-forth bout created massive publicity for both Jay-Z and Nas. In addition to \"Takeover,\" The Blueprint also featured \"Izzo (H.O.V.A.),\" one of the year's biggest hit songs, and the album topped many year-end best-of charts.
Jay-Z capitalized on the runaway success of The Blueprint with a number of follow-up projects. He collaborated with the Roots for the Unplugged album (2001) and with R. Kelly for Best of Both Worlds (2002). He then went on to record, over the course of the year, 40 or so new tracks, 25 of which appeared on his next record, the double album The Blueprint²: The Gift & the Curse (2002). Though billed as a sequel, The Blueprint² was considerably different from its predecessor. Whereas the first volume had been personal, considered, and focused, the second instead offered an unapologetically sprawling double-disc extravaganza showcasing remarkable scope. As usual, it spawned a stream of singles, led by his 2Pac cover \"'03 Bonnie & Clyde\" (featuring his glamorous then-future wife, Beyoncé Knowles from Destiny's Child). Furthermore, Jay-Z guested on a pair of summer 2003 hits: Beyoncé's chart-topping \"Crazy in Love\" and the Neptunes' Top Five hit \"Frontin'.\"
It was then that Jay-Z announced his imminent retirement after the release of one more album. That LP, The Black Album (2003), was rush-released by Def Jam and soared to the top spot in the album charts at the end of the year. As always, it spawned a couple big hits -- \"Dirt Off Your Shoulder\" and \"99 Problems\" -- and inspired a popular mash-up bootleg, The Grey Album, by Danger Mouse. The subsequent year (2004) was a whirlwind for the retiring Jay-Z. He embarked on a farewell tour that was topped off by an extravagant Madison Square Garden performance documented on the Fade to Black DVD, and he also embarked on an ill-fated arena tour with the embattled R. Kelly that resulted in an exchange of ugly multi-million-dollar lawsuits.
With his final album behind him and his reputation bigger than ever, Jay-Z accepted an offer to assume the role of president at Def Jam Records. The seminal rap label was struggling and needed someone to guide it through a rocky transitional phase. Jay-Z accepted the challenge and took over the company begun by Russell Simmons and Rick Rubin roughly 20 years earlier. (As part of its deal with Jay-Z, Def Jam's parent company, Universal, bought Roc-a-Fella, which resulted in some bitterness among certain associates upset by the buyout.) Considerable fanfare met the presidential inauguration, as Jay-Z became one of the few African-American major-label executives in the business, and he also became one of the few rappers to transition into that side of the business. Numerous rappers owned or operated their own boutique labels, but none had ever risen to such major-label heights. And the rapper-turned-president didn't take his job lightly, either, at least judging by his initial year at the helm. Within months of assuming his position, he fostered a string of newfound talents -- Young Jeezy, Teairra Marí, Rihanna, and Bobby V., all of whom enjoyed considerable commercial success -- and only had a few setbacks (disappointing returns on albums by Memphis Bleek and Young Gunz).
In 2005, Jay-Z came out of retirement for the I Declare War concert in New York City. The ambitious show featured a parade of high-profile guest stars, including Diddy, T.I., Kanye West, and in a peacemaking move, Nas. With this longstanding beef squashed, Jay-Z announced he was coming out of retirement for good. He made it official when Kingdom Come hit the shelves in late 2006. Less than a year later, Jay-Z returned with another post-retirement album, American Gangster (2007), this one inspired by the concurrent film of the same name. Two years later, after he left Def Jam and established Roc Nation -- a label, music publisher, and talent agency through Live Nation -- he released a third installment in the Blueprint series, The Blueprint 3. Announced with the single \"D.O.A. (Death of Auto-Tune),\" the album featured productions from Kanye West and Timbaland, plus guest features for West, Rihanna, Young Jeezy, and Alicia Keys. Proof of the MC's enduring relevance, the album topped the Billboard 200. The Hits Collection, Vol. 1 followed in 2010. At various points during 2010 and early 2011, Jay-Z worked on Watch the Throne with partner Kanye West and numerous producers and songwriters. After taking several shapes, the album was released in August 2011 and debuted at number one on the Billboard 200.
On January 7, 2012, Beyoncé gave birth to Blue Ivy Carter. Jay-Z quickly released \"Glory,\" featuring his daughter as B.I.C.; she became the youngest person to appear on a Billboard-charting single. High profile television ads in June 2013 announced Jay-Z's 12th solo album, Magna Carta...Holy Grail. That July 4, the album was made available via an app downloadable through certain models of Samsung smartphones. Digital downloads, physical copies, and streams through other outlets followed days later. Most of its tracks featured production from Timbaland and partner Jerome \"J. Roc\" Harmon, while its lead song involved Justin Timberlake, with whom Jay-Z toured that summer. ~ Jason Birchmeier & Andy Kellman",
        "-index": "1",
        "-viewCount": "4",
        "-lastViewedAt": "1458764623",
        "-thumb": "/library/metadata/1678/thumb/1464508439",
        "-art": "/library/metadata/1678/art/1464508439",
        "-addedAt": "1373386309",
        "-updatedAt": "1464508439",
        "Genre": { "-tag": "Hip-Hop" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4593",
        "-key": "/library/metadata/4593/children",
        "-type": "artist",
        "-title": "Jay-Z & Kanye West",
        "-summary": "Embodying the rags-to-riches rap dream, Jay-Z pulled himself up by his bootstraps as a youth to eventually become the reigning rapper of New York City and, in turn, a major-label executive following his short-lived retirement from music-making. In the wake of his 1996 debut, Reasonable Doubt, Jay-Z's albums sold millions upon millions with each release, and his endless parade of hits made him omnipresent on urban radio and video television. He retained a strongly devoted fan base and challenged whatever rivals attempted to oust him from atop the rap game, sparring most memorably with Nas. Jay-Z and his Roc-a-Fella associates greatly influenced the industry and established many of the trends that pervaded during the late '90s and early 2000s. He consistently worked with the hottest producers of the day (Clark Kent, DJ Premier, Teddy Riley, Trackmasters, Erick Sermon, Timbaland, Swizz Beatz), and if they weren't hot at the time, they likely would be afterward (the Neptunes, Kanye West, Just Blaze, 9th Wonder). He similarly collaborated with the hottest rappers in the industry, everyone from East Coast contemporaries like the Notorious B.I.G. (\"Brooklyn's Finest\") and DMX (\"Cash, Money, Hoes\"), to the best rappers from the South (Ludacris, Missy Elliott) and the West Coast (Snoop Dogg, Too Short). After his self-declared retirement from rapping in 2003, he assumed the presidency of the seminal rap label Def Jam and, as an industry executive, embarked on another phase in his illustrious career.
Born in 1969 and raised in the rough Marcy Projects of Brooklyn, New York, Jay-Z underwent some tough times after his father left his mother before the young rapper was even a teen. Without a man in the house, he became a self-supportive youth, turning to the streets, where he soon made a name for himself as a fledging rapper. Known as \"Jazzy\" in his neighborhood, he soon shortened his nickname to Jay-Z and did all he could to break into the rap game. As he vividly discusses in his lyrics, Jay-Z also became a street hustler around this time, doing what needed to be done to make money. For a while, he ran around with Jaz-O, aka Big Jaz, a small-time New York rapper with a record deal but few sales. From Jaz he learned how to navigate through the rap industry and what moves to make. He also participated in the group Original Flavor for a short time. Jay-Z subsequently decided to make an untraditional decision and start his own label rather than sign with an established label as Jaz had done. Together with friends Damon Dash and Kareem \"Biggs\" Burke, he created Roc-a-Fella Records, a risky strategy for cutting out the middleman and making money for himself. Once he found a reputable distributor, Priority Records (and then later Def Jam), Jay-Z finally had everything in place, including a debut album, Reasonable Doubt (1996).
Though Reasonable Doubt only reached number 23 on Billboard's album chart, Jay-Z's debut eventually became recognized as an undisputed classic among fans, many of whom consider it his crowning achievement. Led by the hit single \"Ain't No Nigga,\" a duet featuring Foxy Brown, Reasonable Doubt slowly spread through New York; some listeners were drawn in because of big names like DJ Premier and the Notorious B.I.G., others by the gangsta motifs very much in style at the time, still others by Jay-Z himself. By the end of its steady run, Reasonable Doubt generated three more charting singles -- \"Can't Knock the Hustle,\" which featured Mary J. Blige on the hook; \"Dead Presidents,\" which featured a prominent sample of \"The World Is Yours,\" a 1994 hit by Nas, and \"Feelin' It\" -- and set the stage for Jay-Z's follow-up, In My Lifetime, Vol. 1 (1997).
Peaking at number three on the Billboard album chart, In My Lifetime sold much more strongly than its predecessor. The album boasted pop-crossover producers such as Puff Daddy and Teddy Riley, and singles such as \"Sunshine\" and \"The City Is Mine\" indeed showcased a newfound embrace of pop crossover. Yet there were still plenty of hard-hitting songs, such as \"Streets Is Watching\" and \"Rap Game/Crack Game\" to lace In My Lifetime with gangsta rap as well as pop crossover. Jay-Z's next album, Vol. 2: Hard Knock Life (1998), released a year after In My Lifetime, was laden with hit singles: \"Can I Get A...\" and \"Hard Knock Life (Ghetto Anthem)\" broke the Top 20 of the Billboard Hot 100, while \"Cash, Money, Hoes\" and \"Nigga What, Nigga Who\" also charted. Vol. 2: Hard Knock Life ended up winning a Grammy for Best Rap Album.
Like clockwork, Jay-Z returned a year later with another album, Vol. 3: Life and Times of S. Carter (1999), which topped the Billboard 200 and spawned two hits: \"Big Pimpin'\" and \"Do It Again (Put Ya Hands Up).\" The album was Jay-Z's most collaborative to date, featuring ten guest vocalists and a roll call of in-demand producers such as Dr. Dre and Timbaland. Jay-Z then scaled back a bit for Dynasty Roc la Familia (2000), his fifth album in as many years. The album showcased Roc-a-Fella's in-house rappers: Beanie Sigel guests on seven of the 16 tracks, Memphis Bleek guests on six, and both Amir and Freeway also make guest appearances. On Dynasty Roc la Familia, Jay-Z also began working with a few new producers: the Neptunes, Kanye West, and Just Blaze. The Neptunes-produced \"I Just Wanna Love U (Give It 2 Me)\" became a particularly huge hit single this go-round.
Jay-Z's next album, The Blueprint (2001), solidified his position atop the New York rap scene upon its release in September. Prior to the album's release, the rapper had caused a stir in New York following his headlining performance at Hot 97's Summer Jam 2001, where he debuted the song \"Takeover.\" The song features a harsh verse ridiculing Prodigy of Mobb Deep, and Jay-Z accentuated his verbal assault (including the lines \"You's a ballerina/I seen ya\") by showcasing gigantic photos of an adolescent Prodigy in a dance outfit. The version of \"Takeover\" that later appeared on The Blueprint includes a third verse, this one dissing Nas, who, in response to the Summer Jam performance, had called out Jay-Z, \"the fake king of New York,\" in a freestyle known as \"Stillmatic.\" As expected, \"Takeover\" ignited a sparring match with Nas, who responded with \"Ether.\" Jay-Z accordingly returned with a comeback, \"Super Ugly,\" where he rapped over the beats to Nas' \"Get Ur Self a...\" on the first verse and Dr. Dre's \"Bad Intentions\" on the second. The back-and-forth bout created massive publicity for both Jay-Z and Nas. In addition to \"Takeover,\" The Blueprint also featured \"Izzo (H.O.V.A.),\" one of the year's biggest hit songs, and the album topped many year-end best-of charts.
Jay-Z capitalized on the runaway success of The Blueprint with a number of follow-up projects. He collaborated with the Roots for the Unplugged album (2001) and with R. Kelly for Best of Both Worlds (2002). He then went on to record, over the course of the year, 40 or so new tracks, 25 of which appeared on his next record, the double album The Blueprint²: The Gift & the Curse (2002). Though billed as a sequel, The Blueprint² was considerably different from its predecessor. Whereas the first volume had been personal, considered, and focused, the second instead offered an unapologetically sprawling double-disc extravaganza showcasing remarkable scope. As usual, it spawned a stream of singles, led by his 2Pac cover \"'03 Bonnie & Clyde\" (featuring his glamorous then-future wife, Beyoncé Knowles from Destiny's Child). Furthermore, Jay-Z guested on a pair of summer 2003 hits: Beyoncé's chart-topping \"Crazy in Love\" and the Neptunes' Top Five hit \"Frontin'.\"
It was then that Jay-Z announced his imminent retirement after the release of one more album. That LP, The Black Album (2003), was rush-released by Def Jam and soared to the top spot in the album charts at the end of the year. As always, it spawned a couple big hits -- \"Dirt Off Your Shoulder\" and \"99 Problems\" -- and inspired a popular mash-up bootleg, The Grey Album, by Danger Mouse. The subsequent year (2004) was a whirlwind for the retiring Jay-Z. He embarked on a farewell tour that was topped off by an extravagant Madison Square Garden performance documented on the Fade to Black DVD, and he also embarked on an ill-fated arena tour with the embattled R. Kelly that resulted in an exchange of ugly multi-million-dollar lawsuits.
With his final album behind him and his reputation bigger than ever, Jay-Z accepted an offer to assume the role of president at Def Jam Records. The seminal rap label was struggling and needed someone to guide it through a rocky transitional phase. Jay-Z accepted the challenge and took over the company begun by Russell Simmons and Rick Rubin roughly 20 years earlier. (As part of its deal with Jay-Z, Def Jam's parent company, Universal, bought Roc-a-Fella, which resulted in some bitterness among certain associates upset by the buyout.) Considerable fanfare met the presidential inauguration, as Jay-Z became one of the few African-American major-label executives in the business, and he also became one of the few rappers to transition into that side of the business. Numerous rappers owned or operated their own boutique labels, but none had ever risen to such major-label heights. And the rapper-turned-president didn't take his job lightly, either, at least judging by his initial year at the helm. Within months of assuming his position, he fostered a string of newfound talents -- Young Jeezy, Teairra Marí, Rihanna, and Bobby V., all of whom enjoyed considerable commercial success -- and only had a few setbacks (disappointing returns on albums by Memphis Bleek and Young Gunz).
In 2005, Jay-Z came out of retirement for the I Declare War concert in New York City. The ambitious show featured a parade of high-profile guest stars, including Diddy, T.I., Kanye West, and in a peacemaking move, Nas. With this longstanding beef squashed, Jay-Z announced he was coming out of retirement for good. He made it official when Kingdom Come hit the shelves in late 2006. Less than a year later, Jay-Z returned with another post-retirement album, American Gangster (2007), this one inspired by the concurrent film of the same name. Two years later, after he left Def Jam and established Roc Nation -- a label, music publisher, and talent agency through Live Nation -- he released a third installment in the Blueprint series, The Blueprint 3. Announced with the single \"D.O.A. (Death of Auto-Tune),\" the album featured productions from Kanye West and Timbaland, plus guest features for West, Rihanna, Young Jeezy, and Alicia Keys. Proof of the MC's enduring relevance, the album topped the Billboard 200. The Hits Collection, Vol. 1 followed in 2010. At various points during 2010 and early 2011, Jay-Z worked on Watch the Throne with partner Kanye West and numerous producers and songwriters. After taking several shapes, the album was released in August 2011 and debuted at number one on the Billboard 200.
On January 7, 2012, Beyoncé gave birth to Blue Ivy Carter. Jay-Z quickly released \"Glory,\" featuring his daughter as B.I.C.; she became the youngest person to appear on a Billboard-charting single. High profile television ads in June 2013 announced Jay-Z's 12th solo album, Magna Carta...Holy Grail. That July 4, the album was made available via an app downloadable through certain models of Samsung smartphones. Digital downloads, physical copies, and streams through other outlets followed days later. Most of its tracks featured production from Timbaland and partner Jerome \"J. Roc\" Harmon, while its lead song involved Justin Timberlake, with whom Jay-Z toured that summer. ~ Jason Birchmeier & Andy Kellman",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1458845723",
        "-thumb": "/library/metadata/4593/thumb/1464508419",
        "-art": "/library/metadata/4593/art/1464508419",
        "-addedAt": "1451589639",
        "-updatedAt": "1464508419",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2029",
        "-key": "/library/metadata/2029/children",
        "-type": "artist",
        "-title": "Kanye West",
        "-summary": "Kanye Omari West (born June 8, 1977 in Atlanta, Georgia) is a Grammy award winning rapper, producer, author, designer and singer.",
        "-index": "1",
        "-viewCount": "85",
        "-lastViewedAt": "1463334956",
        "-thumb": "/library/metadata/2029/thumb/1464508466",
        "-art": "/library/metadata/2029/art/1464508466",
        "-addedAt": "1259039735",
        "-updatedAt": "1464508466",
        "Genre": [
          { "-tag": "Rap & Hip Hop" },
          { "-tag": "Hip-Hop" },
          { "-tag": "Rap" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4354",
        "-key": "/library/metadata/4354/children",
        "-type": "artist",
        "-title": "Kanye West & Jay Z",
        "-summary": "In the span of three short years, Kanye West went from hip-hop beatmaker to worldwide hitmaker, as his stellar production work for Jay-Z led to a major-label recording contract and, ultimately, a wildly successful solo career. West paired his beats with tongue-twisting raps and a self-assured, flamboyant personality. His dapper fashion sense set him apart from many of his rap peers, and his confidence often came across as boastful or even egotistical, albeit amusingly so. This flamboyance, of course, made for good press, something that West enjoyed in spades during his sudden rise to celebrity status. He was a media darling, appearing and performing at countless awards shows (and winning at them, too), delivering theatrical videos to MTV, and mouthing off about whatever happened to cross his mind. He frequently spoke out against the rampant homophobia evident in much rap music, posed for the cover of Rolling Stone as Jesus Christ, and even claimed during a televised Hurricane Katrina fundraiser that \"George Bush doesn't care about black people.\" West courted controversy, no question about it, but his steady presence in the celebrity limelight couldn't eclipse his musical talent. His production abilities seemed boundless during his initial surge of activity, as he not only racked up impressive hits for himself (including \"Jesus Walks\" and \"Gold Digger\"), but also collaborated on smash hits with the likes of Jay-Z and Ludacris. As his career progressed throughout the early 21st century, West shattered certain stereotypes about rappers, becoming a superstar on his own terms without adapting his appearance, his rhetoric, or his music to fit any one musical mold.
Coming out of left field (i.e., Chicago, a city rarely praised for its hip-hop exports), West was an unlikely sensation and more than once defied adversity. Like so many others who were initially inspired by Run-D.M.C., he began as just another aspiring rapper with a boundless passion for hip-hop, albeit a rapper with a Midas touch when it came to beatmaking. Indeed, it was his beatmaking prowess that got his foot in the industry door. Though he did quite a bit of noteworthy production work during the late '90s (Jermaine Dupri, Foxy Brown, Mase, Goodie Mob), it was West's work for Roc-a-Fella at the dawn of the new millennium that took his career to the next level. Alongside fellow fresh talent Just Blaze, West became one of the Roc's go-to producers, consistently delivering hot tracks to album after album. His star turn came on Jay-Z's classic Blueprint (2001) with album standouts \"Takeover\" and \"Izzo (H.O.V.A.).\" Both songs showcased West's signature beatmaking style of the time, which was largely sample-based; in these cases, the former track appropriated snippets of the Doors' \"Five to One,\" while the latter sampled the Jackson 5's \"I Want You Back.\"
More high-profile productions followed, and before long word spread that West was going to release an album of his own, on which he planned to rap as well as produce. Unfortunately, that album was a long time coming, pushed back and then pushed back again. It didn't help that West was in a tragic car accident in October 2002 that almost cost him his life. He capitalized on the traumatic experience by using it as the inspiration for \"Through the Wire\" (and its corresponding video), which would later become the lead single for his debut album, 2004's The College Dropout. As the album was continually delayed, West continued to churn out big hits for the likes of Talib Kweli (\"Get By\"), Ludacris (\"Stand Up\"), Jay-Z (\"'03 Bonnie & Clyde\"), and Alicia Keys (\"You Don't Know My Name\"). Then, just as \"Through the Wire\" was breaking big-time at the tail end of 2003, another West song caught fire, a collaboration with Twista and comedian/actor Jamie Foxx called \"Slow Jamz,\" which gave the rapper/producer two simultaneously ubiquitous singles and a much-anticipated debut album. As with so many of West's songs, the singles were driven by somewhat recognizable sample-based hooks: Chaka Khan's \"Through the Fire\" in the case of \"Through the Wire,\" and Luther Vandross' \"A House Is Not a Home\" in the case of \"Slow Jamz.\"
In the wake of his breakout success, West earned a whopping ten nominations at the 47th annual Grammy Awards, held in early 2005. The College Dropout won the Best Rap Album award, \"Jesus Walks\" won Best Rap Song, and a songwriting credit on \"You Don't Know My Name\" for Best R&B Song award was shared with Alicia Keys and Harold Lilly. Later that year, West released his second solo album, Late Registration, which spawned a series of hit singles (\"Diamonds in Sierra Leone,\" \"Gold Digger,\" \"Heard 'Em Say,\" \"Touch the Sky\"). The album topped the charts, as did the \"Gold Digger\" single, and Late Registration eventually won a Grammy for Album of the Year. West's production work continued more or less unabated during this time; particularly noteworthy were hits for Twista (\"Overnight Celebrity\"), Janet Jackson (\"I Want You\"), Brandy (\"Talk About Our Love\"), the Game (\"Dreams\"), Common (\"Go!\"), and Keyshia Cole (\"I Changed My Mind\"). West also founded his own label, GOOD Music (i.e., \"Getting Out Our Dreams\"), in conjunction with Sony BMG. The label's inaugural release was John Legend's Get Lifted (2004), followed one year later by Common's Be. In addition to all of his studio work, West also toured internationally in support of Late Registration and released Late Orchestration: Live at Abbey Road Studios (2006) in commemoration.
After retreating from the spotlight for some time, West returned to the forefront of the music world in 2007 with a series of album releases. Consequence's Don't Quit Your Day Job and Common's Finding Forever, both released by GOOD, were chiefly produced by West; the latter proved to be particularly popular, topping the album chart upon its release in July. And then there was West's third solo album, Graduation, which was promoted well in advance of its September 11 release (a memorable date that pitted Kanye against 50 Cent, who in one interview swore he would quit music if his own album, Curtis, wasn't the top-seller). A pair of singles -- \"Can't Tell Me Nothing\" and \"Stronger,\" the latter an interpolation of Daft Punk's 2001 single \"Harder, Better, Faster, Stronger\" -- led the promotional push. It became his third consecutive chart-topping album, and its success culminated in eight Grammy nominations. West was the victor in four of the categories, and he performed two songs during the ceremony, including Late Registration's \"Hey Mama,\" chosen in honor of his recently deceased mother. That loss, compounded by a breakup with his fiancée, informed 2008's 808s & Heartbreak, a major change of pace that saw West singing most of his emotionally pained lyrics with the assistance of Auto-Tune. As polarizing as it was, it went platinum.
My Beautiful Dark Twisted Fantasy, most of which was recorded in Hawaii and involved guest vocal spots from the likes of Nicki Minaj, Kid Cudi, Rick Ross, and the RZA, was released in November 2010. It was preceded by the bombastic, King Crimson-sampling single \"Power.\" A sprawling and audacious album, MBDTF debuted at number one on the Billboard 200 and also went platinum. While the album was still hot, West recorded the aggressive and boast-heavy Watch the Throne with Jay-Z and numerous producers and songwriters. Billed as a set by the Throne, it was released in August 2011 and entered the Billboard Top 200 chart at number one. In September 2012, he released the GOOD Music collaboration album Cruel Summer which featured artists such as Big Sean, Pusha T and Lifted. Four singles (\"Mercy\", \"Cold\", \"New Flow\" and \"Clique\") were released as promotion for the record. Towards the end of 2012 there were rumblings from acclaimed producers that a new album would emerge soon. These murmurs were soon confirmed when West himself announced that he was working on his sixth album with the likes of Daft Punk, King L, Justin Vernon, Rick Rubin, Chief Keef and many more contributing. As one of the most eagerly anticipated albums of 2013, Yeezus was released to rapturous reviews from critics. Described as his most confrontational and bravest album to date, West touched upon controversial and sensitive topics and delivered an astonishing and bold record. Despite leaking four days early upon its release, Yeezus sold almost 327,000 copies during its first week and the single \"Black Skinhead\" was released. 2013 also proved to be a personal milestone for West as he became a father for the first time, with partner Kim Kardashian giving birth to a baby girl in June 2013. ~ Jason Birchmeier & Andy Kellman",
        "-index": "1",
        "-viewCount": "3",
        "-lastViewedAt": "1458846278",
        "-thumb": "/library/metadata/4354/thumb/1464508431",
        "-art": "/library/metadata/4354/art/1464508431",
        "-addedAt": "1451589620",
        "-updatedAt": "1464508431",
        "Genre": { "-tag": "Rap" }
      },
      {
        "-ratingKey": "4416",
        "-key": "/library/metadata/4416/children",
        "-type": "artist",
        "-title": "Kanye West & Jay Z;",
        "-summary": "A collaboration between American hip hop artists Jay-Z and Kanye West. Their album, Watch the Throne, was released digitally on August 8th 2011, while the physical CD was released in stores on the 12th. The first single from the album, H•A•M, was released on January 11th, 2011, and the second single, Otis (feat. Otis Redding), was released on July 20th, 2011.",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1458846097",
        "-thumb": "/library/metadata/4416/thumb/1464508433",
        "-art": "/library/metadata/4416/art/1464508433",
        "-addedAt": "1451589623",
        "-updatedAt": "1464508433",
        "Genre": { "-tag": "Rap" }
      },
      {
        "-ratingKey": "1660",
        "-key": "/library/metadata/1660/children",
        "-type": "artist",
        "-title": "Kendrick Lamar",
        "-summary": "Kendrick Lamar (born Kendrick Lamar Duckworth June 17, 1987) is a rapper from Compton, California. He is also a member of the hip-hop supergroup Black Hippy collective along with members Jay Rock, Ab-Soul and Schoolboy Q. His music is largely influenced by the works of 2Pac, Jay-Z, Nas and DMX.",
        "-index": "1",
        "-viewCount": "8",
        "-lastViewedAt": "1449610078",
        "-thumb": "/library/metadata/1660/thumb/1464508441",
        "-art": "/library/metadata/1660/art/1464508441",
        "-addedAt": "1426489064",
        "-updatedAt": "1464508441",
        "Genre": [
          { "-tag": "Hip-Hop" },
          { "-tag": "Rap" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2215",
        "-key": "/library/metadata/2215/children",
        "-type": "artist",
        "-title": "Kid Ink",
        "-summary": "MC and producer Kid Ink -- born Brian Todd Collins in Los Angeles, California, and formerly known as Rockstar -- rose steadily by releasing a series of four mixtapes during 2010 and 2011. XXL magazine was impressed enough to list Kid Ink beside the likes of Danny Brown and Macklemore in its Freshman Class feature for 2012. That June, Kid Ink released Up & Away, his first proper studio album, via Tha Alumni. Although it featured beats from several producers -- including Ned Cameron, Cardiak, Jahlil Beats, and the Amazinz -- there were no guest verses, and therefore no disruptions in Kid Ink's nonchalant flow. It peaked at number 20 on the Billboard 200 chart and reached number three on the publication's Top R&B/Hip-Hop Albums chart. After another mixtape, he signed to major label RCA and prepared his second album. ~ Andy Kellman",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1454265147",
        "-thumb": "/library/metadata/2215/thumb/1464508454",
        "-art": "/library/metadata/2215/art/1464508454",
        "-addedAt": "1424276702",
        "-updatedAt": "1464508454",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4351",
        "-key": "/library/metadata/4351/children",
        "-type": "artist",
        "-title": "Lana Del Rey",
        "-summary": "Elizabeth \"Lizzy\" Grant (born 21 June 1986), better known as Lana Del Rey, is a singer-songwriter from Lake Placid, New York, United States.  Del Rey is known for embellishing her songs and music videos with an eerily nostalgic vibe heavy on Americana themes, including images of surfing, Coney Island, Frank Sinatra, and Marilyn Monroe.  She has also listed a large number of her artistic influences, including Allen Ginsberg, Elvis Presley, Britney Spears, Nina Simone, Nirvana, Leonard Cohen, Bob Dylan, The Beach Boys, Antony and the Johnsons, actor and filmmaker John Waters, artists Mark Ryden and Marilyn Minter, and photographers Juergen Teller and Philip-Lorca diCorcia.",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1454267097",
        "-thumb": "/library/metadata/4351/thumb/1464508492",
        "-art": "/library/metadata/4351/art/1464508492",
        "-addedAt": "1451589619",
        "-updatedAt": "1464508492",
        "Genre": { "-tag": "Pop" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2203",
        "-key": "/library/metadata/2203/children",
        "-type": "artist",
        "-title": "Lorde",
        "-summary": "Ella Marija Lani Yelich-O'Connor (born 7 November 1996), known by her stage name \"Lorde\" (pronounced (/ˈlɔrd/) (IPA) or \"lord\" in standard English), is a New Zealand singer-songwriter and multiple Grammy Awards winner. She released her first EP, The Love Club EP, in March 2013 and her first single, \"Royals\", in June 2013. Her début album, Pure Heroine, was released on September 27, 2013.",
        "-index": "1",
        "-viewCount": "36",
        "-lastViewedAt": "1463342547",
        "-thumb": "/library/metadata/2203/thumb/1464508446",
        "-art": "/library/metadata/2203/art/1464508446",
        "-addedAt": "1380326916",
        "-updatedAt": "1464508446",
        "Genre": { "-tag": "Pop" },
        "Country": { "-tag": "New Zealand" }
      },
      {
        "-ratingKey": "1714",
        "-key": "/library/metadata/1714/children",
        "-type": "artist",
        "-title": "Lupe Fiasco",
        "-summary": "Chicago-based MC Lupe Fiasco (born Wasalu Muhammad Jaco) began rapping in junior high school and joined a group called da Pak several years later. The group signed to Epic, released one single, and split up, all before Fiasco reached the age of 20. Thanks in part to the vocal support of Jay-Z, L.A. Reid signed Fiasco as a solo artist to Arista, but before anything of significance was able to happen (only a promo single and a couple guest appearances were set up), Reid was fired, leaving the MC without a label. Fiasco eventually landed at Atlantic. Preceded by the single \"Kick, Push,\" as well as several mixtapes and an appearance on Kanye West's \"Touch the Sky,\" the album Food & Liquor was set to surface during early 2006, though an unfinished version leaked during the spring, pushing its official release back to September instead. The album peaked at number eight on the Billboard 200 and earned the cerebral rapper three Grammy nominations; \"Daydreamin'\" (featuring Jill Scott) won the award for Best Urban/Alternative Performance. A highly conceptualized follow-up, The Cool, was released in December 2007. Gold sales certification and four additional Grammy nominations followed.
Despite his track record, Fiasco met a number of obstacles on the way to the release of his third album, Lasers. The process culminated in a petition signed by over 30,000 followers who demanded that Atlantic release the long-delayed album, which was followed by a fan protest outside the label's New York City offices. Lasers, finally issued by Atlantic in March 2011, topped three charts: the Billboard 200, Hot R&B/Hip Hop Albums, and Hot Rap Albums. It was propelled by \"The Show Must Go On\" (which barely scratched the upper half of the Hot R&B/Hip-Hop, but went Top Ten on the Hot 100) and \"Out of My Head\" (number 40 Hot 100; number 11 Hot R&B/Hip-Hop). Work on the MC's fourth album, cumbersomely titled Food & Liquor II: The Great American Rap Album, Pt. 1, began while Lasers was in pre-release limbo. Its development and September 2012 birth was relatively uncomplicated, though Fiasco -- never one to evade controversy -- received some backlash for \"Around My Way (Freedom Ain't Free)\" (for its bold use of Pete Rock & C.L. Smooth's 1992 classic \"They Reminisce Over You [T.R.O.Y.]\") and \"Bitch Bad\" (criticized so firmly by Spin magazine that it prompted Fiasco to call for a boycott of the publication). ~ Andy Kellman",
        "-index": "1",
        "-viewCount": "10",
        "-lastViewedAt": "1459303714",
        "-thumb": "/library/metadata/1714/thumb/1464508447",
        "-art": "/library/metadata/1714/art/1464508447",
        "-addedAt": "1424276609",
        "-updatedAt": "1464508447",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4325",
        "-key": "/library/metadata/4325/children",
        "-type": "artist",
        "-title": "M.I.A.",
        "-summary": "If you read a lot about new music on the web, odds are pretty good that, at some point between the September 2004 release of \"Galang\" and the March 2005 release of Arular, you were struck with the urge to turn your computer off or maybe even heave it out of a nearby window. If you don't read a lot about new music on the web, the preceding sentence indicates how bewildering and draining the chatter about M.I.A. became. Arular, M.I.A.'s first album, leaked well before its official release, allowing journalists and downloaders plenty of time to dissect it and bat ideas back and forth -- taking in the sounds, words, and absolutely all of the context -- before average music fans were able to develop their own opinions.
Maya Arulpragasam spent the early years of her life in a number of places. She moved from London, England, to her parents' native Sri Lanka at the age of six months, only to relocate to Madras, India. During a return stay in Sri Lanka, the civil war taking place within the country escalated to the point where Arulpragasam began to lose family members and friends. She didn't see her father -- a devout and active separatist as part of the Tamil rebellion, which has clashed with the Sinhalese majority -- often throughout these years, but her life stabilized once she and the rest of her family were able to make it back to London.
As a student, Arulpragasam became involved in the arts and published a monogram book of her paintings titled M.I.A. and heavily influenced by the Tamil rebellion. She later connected with Elastica, providing the photography and graphics for the group's second album, and she shot footage during their American tour. Elastica's support act, Peaches, introduced her to the Roland MC-505, a sequencer she became familiar with after returning home. Steve Mackey (Pulp) and Ross Orton became involved after hearing a demo; they made adjustments to \"Galang,\" a song that was then pressed into 500 copies and released, under the name M.I.A., by the Showbiz label. It didn't take long for the song -- a bold, righteous amalgamation of hip-hop, electro, dancehall, grime, and baile funk -- to make an impact with DJs. She wound up signing a contract with XL, which re-released the single and, eventually, her debut album Arular in 2005. Anticipation for the release was considerable, only heightened by the Piracy Funds Terrorism mixtape she put together with DJ Diplo.
Her second album, Kala, was released in 2007 and was recorded while she spent time in numerous countries. M.I.A. produced most of its tracks with Switch; Blaqstarr, Diplo, and Timbaland also contributed. One single from the album, \"Paper Planes,\" became a surprise hit in summer 2008 after it was used in trailers for the film Pineapple Express; it eventually reached the Top Ten. The soundtrack for the Academy Award-winning Slumdog Millionaire also featured M.I.A.'s music; the release featured new material from the artist and was the first disc issued on her N.E.E.T. label. /\\/\\/\\Y/\\, the third M.I.A. album, was released in 2010.  After spending two years preparing her fourth studio album, Matangi, she released the single \"Bad Girls, a reworked version of a song that debuted on her Vicki Leekx mixtape and featured production by Danja, in early 2012. Around that time, M.I.A. performed \"Give Me All Your Luvin'\" with Madonna and Nicki Minaj at Super Bowl XLVI's halftime show; during the performance, she extended her middle finger at the camera. A month later, the NFL responded by suing her for $1.5 million, claiming that she breached her contract and tarnished the organization's image. Matangi was originally scheduled for release at the end of 2012, but was delayed until the following year. Two more singles, \"Bring the Noize\" and \"Come Walk with Me,\" were released in June and September 2013 respectively. Featuring production by Switch and Surkin, Matangi arrived that November. ~ Andy Kellman",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1454262555",
        "-thumb": "/library/metadata/4325/thumb/1464508455",
        "-art": "/library/metadata/4325/art/1464508455",
        "-addedAt": "1451589612",
        "-updatedAt": "1464508455",
        "Genre": [
          { "-tag": "Electronic" },
          { "-tag": "Pop" }
        ],
        "Country": { "-tag": "Sri Lanka" }
      },
      {
        "-ratingKey": "1991",
        "-key": "/library/metadata/1991/children",
        "-type": "artist",
        "-title": "Macklemore",
        "-summary": "A grassroots success, Seattle rapper Macklemore not only climbed to number two on the Billboard 200 album charts, but with little mainstream help, his 2012 sophomore release debuted with only Mumford & Sons in his way for the number one spot. Born Ben Haggerty and raised in Seattle, he debuted as Professor Macklemore in 2000 with the Open Your Eyes EP. Five years later his debut album, The Language of My World, earned him a local following, but it was his 2010 team-up with DJ/producer Ryan Lewis for the Vs. Redux EP that yielded the Red Hot Chili Peppers-sampling hit \"Otherside.\" With Macklemore's wit meeting Lewis' inventive production, further hits like \"My Oh My\" and \"Can't Hold Us\" were spread throughout social media and video-sharing sites, setting the stage for a successful sophomore release. That came in 2012 when The Heist dropped as a Macklemore/Ryan Lewis release, debuting at the number two spot on the Billboard 200. A tour of North America followed. ~ David Jeffries",
        "-index": "1",
        "-viewCount": "6",
        "-lastViewedAt": "1463342842",
        "-thumb": "/library/metadata/1991/thumb/1464508446",
        "-art": "/library/metadata/1991/art/1464508446",
        "-addedAt": "1360932778",
        "-updatedAt": "1464508446",
        "Genre": { "-tag": "Hip-Hop" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4342",
        "-key": "/library/metadata/4342/children",
        "-type": "artist",
        "-title": "Macklemore & Ryan Lewis",
        "-summary": "A grassroots success, Seattle rapper Macklemore not only climbed to number two on the Billboard 200 album charts, but with little mainstream help, his 2012 sophomore release debuted with only Mumford & Sons in his way for the number one spot. Born Ben Haggerty and raised in Seattle, he debuted as Professor Macklemore in 2000 with the Open Your Eyes EP. Five years later his debut album, The Language of My World, earned him a local following, but it was his 2010 team-up with DJ/producer Ryan Lewis for the Vs. Redux EP that yielded the Red Hot Chili Peppers-sampling hit \"Otherside.\" With Macklemore's wit meeting Lewis' inventive production, further hits like \"My Oh My\" and \"Can't Hold Us\" were spread throughout social media and video-sharing sites, setting the stage for a successful sophomore release. That came in 2012 when The Heist dropped as a Macklemore/Ryan Lewis release, debuting at the number two spot on the Billboard 200. A tour of North America followed. ~ David Jeffries",
        "-index": "1",
        "-thumb": "/library/metadata/4342/thumb/1464508452",
        "-art": "/library/metadata/4342/art/1464508452",
        "-addedAt": "1451589615",
        "-updatedAt": "1464508452",
        "Genre": { "-tag": "Rap" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4339",
        "-key": "/library/metadata/4339/children",
        "-type": "artist",
        "-title": "Major Lazer",
        "-summary": "Major Lazer is the digital reggae/dancehall project of Diplo (Philadelphia's Wes Pentz) and Switch (London's Dave Taylor), two globetrotting, tastemaking DJ/producers whose previous collaborations notably included production work for M.I.A. and Santigold. Recorded at Jamaica's Tuff Gong studios, their debut album, Guns Don't Kill People... Lazers Do, featured vocal contributions from noted dancehall stars including Vybz Cartel, Busy Signal, Mr. Vegas, and Turbulence, as well as Santigold, Nina Sky, and rapper Amanda Blank. Much anticipation and online chatter were fueled in part by the novelty video/song \"Zumbi,\" featuring the comedian Andy Milonakis, the frenetic, legitimate lead single \"Hold the Line,\" and a goofy, invented back-story about a renegade Jamaican commando with prosthetic laser arms who was allegedly a Zombie War veteran and vampire-fighting C.I.A. operative (but was demonstrably a rampant Twitter user). The album was released in June of 2009 as a joint venture between Downtown Records and Diplo's Mad Decent label. Lazers Never Die, an EP with two new songs and three remixes, followed in 2010, along with Lazerproof, a collaborative mixtape with the English electro-pop duo La Roux. In 2012, Snoop Dogg joined Diplo for the digital reggae single \"La La La,\" released under the name Snoop Lion, while Switch announced he was leaving the project. Diplo carried on with producer Jillionaire, joining the group for Free the Universe, the group's sophomore album. The 2013 release featured Wyclef, Bruno Mars, Vybz Kartel, and Shaggy on its quite long guest list. ~ K. Ross Hoffman",
        "-index": "1",
        "-thumb": "/library/metadata/4339/thumb/1464508466",
        "-art": "/library/metadata/4339/art/1464508466",
        "-addedAt": "1451589614",
        "-updatedAt": "1464508466",
        "Genre": { "-tag": "Dance" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4328",
        "-key": "/library/metadata/4328/children",
        "-type": "artist",
        "-title": "MGMT",
        "-summary": "MGMT is a neo psychedelia/alternative rock group which formed in Middletown, Connecticut, United States in 2002 by Andrew VanWyngarden and Ben Goldwasser.",
        "-index": "1",
        "-viewCount": "12",
        "-lastViewedAt": "1463344060",
        "-thumb": "/library/metadata/4328/thumb/1464508474",
        "-art": "/library/metadata/4328/art/1464508474",
        "-addedAt": "1451589613",
        "-updatedAt": "1464508474",
        "Genre": [
          { "-tag": "Rock" },
          { "-tag": "Pop" },
          { "-tag": "Alternative" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2126",
        "-key": "/library/metadata/2126/children",
        "-type": "artist",
        "-title": "My Morning Jacket",
        "-summary": "Starting in the late ‘90s and throughout the 2000s and 2010s, My Morning Jacket expanded on their rock and country roots, embracing everything from neo-psychedelia to funk, prog, and reggae in their sonic experimentation. By the time Evil Urges arrived in mid-2008, they had successfully molded themselves into Kentucky's answer to Wilco: a band rooted in alt-country and rock & roll, but given to sonic experimentation and unexpected genre changes at every turn.
My Morning Jacket's de facto leader is vocalist/guitarist Jim James (birth name: James Olliges; occasional pseudonym: Yim Yames), who founded the band in 1998 alongside his cousin Johnny Quaid (guitar), Tom Blankenship (bass), and J. Glenn (drums). Headquartered in James' hometown of Louisville, Kentucky, the group released its debut on Darla Records in 1999, with keyboardist Danny Cash joining the lineup one year later. Although The Tennessee Fire was only modestly popular in the U.S., it became a genuine hit overseas, particularly in the Netherlands. My Morning Jacket responded by launching a tour in Europe, where they were featured in a Dutch documentary film and received accolades from the Dutch music press. A Christmas EP was released in 2000, but it was My Morning Jacket's follow-up effort -- 2001's At Dawn -- that helped expand their audience at home. Jim James recorded his vocals in a grain silo, and the resulting reverb-heavy sound became a hallmark of the band's early work. After the album's stateside release, James' best friend from childhood, Patrick Hallahan, was recruited as the band's new drummer.
My Morning Jacket maintained a grueling schedule throughout the early 2000s, hitting the road with such acts as Guided by Voices, the Doves, and the Foo Fighters. They also made the jump to a major label (RCA/ATO Records) for the 2003 release of It Still Moves, one of their most praised albums yet. Quaid and Cash announced their departure in January 2004 (keyboardist Bo Koster and guitarist Carl Broemel joined in their place), and the group continued to tour as a unified five-piece. Produced by John Leckie, 2005's Z did away with the heavy reverb that blanketed the band's earlier efforts, while the addition of synthesizers and reggae textures introduced audiences to My Morning Jacket's experimental side. Tracks from Z also appeared on Okonokos, a live album released in 2006.
Arriving in June 2008, Evil Urges showcased James' expanding vocal range, his bandmates' fascination with Prince, and My Morning Jacket's eagerness to challenge the boundaries of alternative country-rock. After touring in support of the album, the bandmates spent several years pursuing their own projects, with Jim James joining the indie supergroup Monsters of Folk and Carl Broemel releasing a solo album. They reconvened for 2011's Circuital, recording the album in a local church's gymnasium and revisiting the quirky, eclectic sound that fueled their two previous albums. ~ Andrew Leahey",
        "-index": "1",
        "-viewCount": "3",
        "-lastViewedAt": "1454266441",
        "-thumb": "/library/metadata/2126/thumb/1464508466",
        "-art": "/library/metadata/2126/art/1464508466",
        "-addedAt": "1377031093",
        "-updatedAt": "1464508466",
        "Genre": { "-tag": "Rock" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "2115",
        "-key": "/library/metadata/2115/children",
        "-type": "artist",
        "-title": "NehruvianDOOM",
        "-summary": "NehruvianDOOM is the namesake of the collaborative duo made up of veteran & legend MF DOOM  & Bishop Nehru, an up and coming New York artist signed to Nas's label, Mass Appeal Records. Read more on Last.fm. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply",
        "-index": "1",
        "-viewCount": "2",
        "-lastViewedAt": "1454262011",
        "-thumb": "/library/metadata/2115/thumb/1464508458",
        "-addedAt": "1423022335",
        "-updatedAt": "1464508458",
        "Genre": { "-tag": "Rap & Hip-Hop" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4322",
        "-key": "/library/metadata/4322/children",
        "-type": "artist",
        "-title": "Pharrell Williams",
        "-summary": "Pharrell Williams (born April 5, 1973 in Virginia Beach, Virginia, United States), also known by his mononym Pharrell, is an American singer-songwriter, rapper, record producer, and fashion designer. Williams and Chad Hugo make up the record production duo the Neptunes, producing soul, hip hop and R&amp;B music. He is also the lead vocalist and drummer of rock, funk, and hip hop band N*E*R*D, which he formed with Hugo and childhood friend Shay Haley. He released his first single \"Frontin'\" in 2003 and followed up with his debut solo album \"In My Mind\" in 2006. His second album, \"G I R L\", was released on March 3, 2014.",
        "-index": "1",
        "-thumb": "/library/metadata/4322/thumb/1464508472",
        "-art": "/library/metadata/4322/art/1464508472",
        "-addedAt": "1451589611",
        "-updatedAt": "1464508472",
        "Genre": { "-tag": "Soundtrack" }
      },
      {
        "-ratingKey": "1604",
        "-key": "/library/metadata/1604/children",
        "-type": "artist",
        "-title": "Run the Jewels",
        "-summary": "Run the Jewels is an American hip-hop duo that consists of emcee/producer El-P and emcee Killer Mike.",
        "-index": "1",
        "-viewCount": "22",
        "-lastViewedAt": "1459018469",
        "-thumb": "/library/metadata/1604/thumb/1464508459",
        "-art": "/library/metadata/1604/art/1464508459",
        "-addedAt": "1372262560",
        "-updatedAt": "1464508459",
        "Genre": { "-tag": "Hip-Hop" }
      },
      {
        "-ratingKey": "4311",
        "-key": "/library/metadata/4311/children",
        "-type": "artist",
        "-title": "Snoop Dogg",
        "-summary": "As the embodiment of '90s gangsta rap, Snoop Dogg blurred the lines between reality and fiction. Introduced to the world through Dr. Dre's The Chronic, Snoop quickly became the most famous star in rap, partially because of his drawled, laconic rhyming and partially because the violence that his lyrics implied seemed real, especially after he was arrested on charges of being a murder accomplice. The arrest certainly strengthened his myth, and it helped his debut album, 1993's Doggystyle, become the first debut album to enter the charts at number one, but in the long run, it hurt his career. Snoop had to fight charges throughout 1994 and 1995, and while he was eventually cleared, it hurt his momentum. The Doggfather, his second album, wasn't released until November 1996, and by that time, pop and hip-hop had burned itself out on gangsta rap. The Doggfather sold half as well as its predecessor, which meant that Snoop remained a star, but he no longer had the influence he had just two years before.
Nicknamed Snoop by his mother because of his appearance, Calvin Broadus (born October 20, 1972) was raised in Long Beach, CA, where he frequently ran into trouble with the law. Not long after his high-school graduation, he was arrested for possession of cocaine, beginning a period of three years when he was often imprisoned. He found escape from a life of crime through music. Snoop began recording homemade tapes with his friend Warren G, who happened to be the stepbrother of N.W.A.'s Dr. Dre. Warren G gave a tape to Dre, who was considerably impressed with Snoop's style and began collaborating with the rapper.
When Dre decided to make his tentative first stab at a solo career in 1992 with the theme song for the film Deep Cover, he had Snoop rap with him. \"Deep Cover\" started a buzz about Snoop that escalated into full-fledged mania when Dre released his own debut album, The Chronic, on Death Row Records late in 1992. Snoop rapped on The Chronic as much as Dre, and his drawled vocals were as important to the record's success as its P-Funk bass grooves. Dre's singles \"Nuthin' But a 'G' Thang\" and \"Dre Day,\" which prominently featured Snoop, became Top Ten pop crossover hits in the spring of 1993, setting the stage for Snoop's much-anticipated debut album, Doggystyle. While he was recording the album with Dre in August, Snoop was arrested in connection with the drive-by shooting death of Phillip Woldermarian. According to the charges, the rapper's bodyguard, McKinley Lee, shot Woldermarian as Snoop drove the vehicle; the rapper claimed it was self-defense, alleging that the victim was stalking Snoop. Following a performance at the MTV Music Awards in September 1993, he turned himself over to authorities.
After many delays, Doggystyle was finally released on Death Row in November of 1993, and it became the first debut album to enter the charts at number one. Despite reviews that claimed the album was a carbon copy of The Chronic, the Top Ten singles \"What's My Name?\" and \"Gin & Juice\" kept Doggystyle at the top of the charts during early 1994, as did the considerable controversy over Snoop's arrest and his lyrics, which were accused of being exceedingly violent and sexist. During an English tour in the spring of 1994, tabloids and a Tory minister pleaded for the government to kick the rapper out of the country, largely based on his arrest. Snoop exploited his impending trial by shooting a short film based on the Doggystyle song \"Murder Was the Case\" and releasing an accompanying soundtrack, which debuted at number one in 1994. By that time, Doggystyle had gone quadruple platinum.
Snoop spent much of 1995 preparing for the case, which finally went to trial in late 1995. In February of 1996, he was cleared of all charges and began working on his second album, this time without Dre as producer. Nevertheless, when The Doggfather was finally released in November 1996, it bore all the evidence of a Dre-produced G-funk record. The album was greeted with mixed reviews, and it initially sold well, but it failed to produce a hit along the lines of \"What's My Name?\" and \"Gin & Juice.\" Part of the reason for the moderate success of The Doggfather was the decline of gangsta rap. 2Pac, who had become a friend of Snoop during 1996, died weeks before the release of The Doggfather, and Dre had left Death Row to his partner Suge Knight, who was indicted on racketeering charges by the end of 1996. Consequently, Snoop's second album got lost in the shuffle, stalling at sales of two million, which was disappointing for a superstar.
Perhaps sensing something was wrong, Snoop began to revamp his public image, moving away from his gangsta roots toward a calmer lyrical aesthetic. He also began making gestures toward the rock community, signing up to tour with Lollapalooza 1997 and talking about two separate collaborations with Beck and Marilyn Manson. The solo Da Game Is to Be Sold Not to Be Told, Snoop's first effort for No Limit, followed in 1998; No Limit Top Dogg appeared a year later and Dead Man Walkin' the year after that. Tha Last Meal followed in December of that same year. The heavy release schedule resulted in varying musical quality from album to album, but by the turn of the century, Snoop had become such a cultural phenomenon that his albums almost became secondary to the personality behind them. An autobiography appeared in 2001, followed by a stream of movie roles in several high-profile pictures. Late in 2002, Snoop released his first album for Capitol, Paid tha Cost to Be da Bo$$. He then switched to Geffen for 2004's R&G (Rhythm & Gangsta): The Masterpiece. The hit album was followed a year later by Welcome to tha Chuuch: Da Album, a collection of tracks from the Welcome to the Chuuch mixtape series. That same year he hosted a West Coast peace summit in hopes of squashing all beefs.
In 2006, he appeared on Tha Dogg Pound's Cali Iz Active and Ice Cube's Laugh Now, Cry Later. Toward the end of the year the intentionally leaked \"My Peoples\" freestyle appeared. The track paid tribute to many involved in Cali's Latin rap community, so it was no big surprise when \"Vato\" with Cypress Hill's B Real became his next album's leadoff single. The hard and very G-funk Tha Blue Carpet Treatment triumphantly capped off a year of heavy West Coast activity. In late 2007, he recruited two hip-hop veterans -- new jack swing legend Teddy Riley and West Coast hero DJ Quik -- and formed the production team QDT Muzic. The team oversaw Snoop's 2008 album, Ego Trippin', which included the single \"Sensual Seduction.\" In 2009, he issued Malice N Wonderland, the maiden release of a new alliance with the reactivated Priority label, which also signed him on as its creative chairman. He promoted the album a couple months prior to its street date when he hosted the live wrestling television broadcast WWE Raw. A year later the CD/DVD set More Malice rounded up some odds and ends from the album and packaged them with a DVD featuring the Malice N Wonderland short film. In 2011, he released Doggumentary, an album he considered the sequel to his classic debut. The album featured production from the likes of Swizz Beats, DJ Khalil, and Scott Storch, while guest artists included Kanye West, John Legend, Wiz Khalifa, and Willie Nelson. Also arriving that same year was a feature film with Khalifa, Mac and Devin Go to High School, along with its accompanying soundtrack. ~ Stephen Thomas Erlewine",
        "-index": "1",
        "-viewCount": "3",
        "-lastViewedAt": "1458766208",
        "-thumb": "/library/metadata/4311/thumb/1464508502",
        "-art": "/library/metadata/4311/art/1464508502",
        "-addedAt": "1451589608",
        "-updatedAt": "1464508502",
        "Genre": [
          { "-tag": "Rap" },
          { "-tag": "Hip Hop" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4308",
        "-key": "/library/metadata/4308/children",
        "-type": "artist",
        "-title": "Stalley",
        "-summary": "Kyle Myricks (Born in Massillon, Ohio, United States), better known by his stage name Stalley  is an American rapper. currently signed to Rick Ross's label, Maybach Music Group, who started his rap career after major injury setbacks in Basketball. Stalley shifted his focus towards music and in 2008 he teamed up with Ohio's DJ, Terry Urban to release his first mixtape titled Goin' Ape. This followed with several mixtape releases in 2009, MadStalley: The Autobiography, 2011, Lincoln Way Nights, and 2012's release, Savage Journey To The American Dream.",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1458763096",
        "-thumb": "/library/metadata/4308/thumb/1464508476",
        "-art": "/library/metadata/4308/art/1464508476",
        "-addedAt": "1451589605",
        "-updatedAt": "1464508476",
        "Genre": { "-tag": "Instrumental" }
      },
      {
        "-ratingKey": "1988",
        "-key": "/library/metadata/1988/children",
        "-type": "artist",
        "-title": "tahnees18@yahoo.co.uk",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1458763456",
        "-addedAt": "1424471596",
        "-updatedAt": "1464508460",
        "Genre": {
          "-tag": "Com[petition"
        }
      },
      {
        "-ratingKey": "2008",
        "-key": "/library/metadata/2008/children",
        "-type": "artist",
        "-title": "Taylor Swift",
        "-summary": "Taylor Swift began performing at the age of ten. By the time she was 12, she had picked up the guitar. She and her family began making regular visits to Nashville, Tennessee, where Swift would perform casually and meet with songwriters in the area. The family decided to move to a Nashville suburb, and while performing at a showcase, Taylor caught the eye of industry veteran Scott Borchetta. He had plans to create a new label and decided she was one of the first acts he wanted to sign. Still a high-school student, she released her debut single, \"Tim McGraw,\" in August 2006, followed by a self-titled album that October. ~ Megan Frye",
        "-index": "1",
        "-viewCount": "10",
        "-lastViewedAt": "1454821352",
        "-thumb": "/library/metadata/2008/thumb/1464508510",
        "-art": "/library/metadata/2008/art/1464508510",
        "-addedAt": "1414238293",
        "-updatedAt": "1464508510",
        "Genre": { "-tag": "Country & Folk" },
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4305",
        "-key": "/library/metadata/4305/children",
        "-type": "artist",
        "-title": "Travie McCoy",
        "-summary": "Travis Lazarus \"Travie\" McCoy (born August 6, 1981 in Geneva, New York) is a rapper, singer, multi-instrumentalist and lead vocalist of the alternative hip hop group Gym Class Heroes. Signed to T-Pain's Nappy Boy Entertainment, he released his solo debut album, Lazarus, on June 8, 2010. The lead single from the album, Billionaire featuring Bruno Mars, has so far reached #4 on the Billboard Hot 100.",
        "-index": "1",
        "-thumb": "/library/metadata/4305/thumb/1464508472",
        "-art": "/library/metadata/4305/art/1464508472",
        "-addedAt": "1451589603",
        "-updatedAt": "1464508472",
        "Genre": { "-tag": "Hip-Hop" }
      },
      {
        "-ratingKey": "1616",
        "-key": "/library/metadata/1616/children",
        "-type": "artist",
        "-title": "Tyler, The Creator",
        "-summary": "The RZA -- and maybe even GZA -- of Odd Future (short for Odd Future Wolf Gang Kill Them All), Tyler, the Creator is the alternative hip-hop crew's main rapper, producer, and source of inspiration. He got his first taste of fame when The Los Angeles Times ran a \"teen on the street\"-type story on the then 16-year-old skateboarding enthusiast, who was also interested in music and fashion. In 2007 he began making music with Odd Future's core members -- Earl Sweatshirt, Left Brain, and Hodgy Beats -- and by the summer of 2010 their bizarre, surreal, and filthy material had earned them a loyal following. It was during that year that a video Tyler directed for the Odd Future track \"French\" took off, topping a million views by December and drawing attention to the slew of crew-related mixtapes that followed, including Tyler's own, Bastard. He was also signed to the XL label in 2010 for a one-album deal. When Tyler's XL album Goblin arrived in 2011, it became the first Odd Future-related product to be released through the usual music industry channels. Wolf followed in 2013, with Left Brain and Frank Ocean returning as guests. ~ David Jeffries",
        "-index": "1",
        "-viewCount": "33",
        "-lastViewedAt": "1459301149",
        "-thumb": "/library/metadata/1616/thumb/1464508494",
        "-art": "/library/metadata/1616/art/1464508494",
        "-addedAt": "1428910950",
        "-updatedAt": "1464508494",
        "Genre": [
          { "-tag": "Hip-Hop" },
          { "-tag": "Rap" },
          { "-tag": "Hip Hop" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4152",
        "-key": "/library/metadata/4152/children",
        "-type": "artist",
        "-title": "Uncle Kracker",
        "-summary": "After serving as DJ for his hometown chum Kid Rock, Uncle Kracker (born Matthew Shafer) stepped out from behind the turntables to release his debut solo album, Double Wide, in 2001. Uncle Kracker had performed alongside Rock since 1994, and both favored a combination of funky, post-grunge rock with a hip-hop aesthetic. Double Wide also sported a polished pop single entitled \"Follow Me,\" and the album went double platinum on the strength of that Top 10 hit.
Kid Rock and Uncle Kracker were practically family. The two met in 1987 in Clawson, Michigan, where Rock was spinning in an all-ages DJ contest at a popular nightspot called Daytona's. After discovering a mutual fondness for the Commodores, Run-D.M.C., Lynyrd Skynyrd, and George Jones, the pair became fast friends. One of Kracker's first musical contributions was on Rock's 1996 release, Early Mornin' Stoned Pimp, and he also co-wrote and performed on Rock's multi-platinum breakthrough, Devil Without a Cause. Striking while the iron was hot, he chose to launch his own career in the wake of Devil's success.
Produced by Kid Rock and Mike Bradford, Double Wide was a radio-friendly effort that blended elements of country, mainstream modern rock, and rap. One year after its release, Uncle Kracker returned with a sophomore album named No Stranger to Shame, scoring another Top Ten hit with a faithful rendition of Mentor Williams' \"Drift Away.\" Taking much from the inspiration of early-'70s rock, he issued Seventy Two & Sunny in late June 2004, but the album failed to live up to its predecessors' success. Kracker renewed his hit-making credentials by co-writing Kid Rock's popular single \"All Summer Long,\" however, and he returned to the solo game in 2009 with Happy Hour. The next year, Uncle Kracker followed up with the EP Happy Hour: The South River Road Sessions, which featured country remakes of songs from Happy Hour. Uncle Kracker's next full-length album, his first for Sugar Hill after leaving Atlantic, was the Keith Stegall-produced Midnight Special, which appeared in the fall of 2012. ~ MacKenzie Wilson",
        "-index": "1",
        "-thumb": "/library/metadata/4152/thumb/1464508486",
        "-art": "/library/metadata/4152/art/1464508486",
        "-addedAt": "1451589364",
        "-updatedAt": "1464508486",
        "Genre": [
          { "-tag": "Rock" },
          { "-tag": "Country" }
        ],
        "Country": { "-tag": "United States" }
      },
      {
        "-ratingKey": "4149",
        "-key": "/library/metadata/4149/children",
        "-type": "artist",
        "-title": "Underground Kingz",
        "-index": "1",
        "-thumb": "/library/metadata/4149/thumb/1464508479",
        "-art": "/library/metadata/4149/art/1464508479",
        "-addedAt": "1451589363",
        "-updatedAt": "1464508479",
        "-titleSortSaved": "1",
        "Genre": { "-tag": "Rap" }
      },
      {
        "-ratingKey": "1966",
        "-key": "/library/metadata/1966/children",
        "-type": "artist",
        "-title": "[Unknown Artist]",
        "-titleSort": "Unknown Artist]",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1449506921",
        "-thumb": "/library/metadata/1966/thumb/1464508466",
        "-art": "/library/metadata/1966/art/1464508466",
        "-addedAt": "1424471601",
        "-updatedAt": "1464508466"
      },
      {
        "-ratingKey": "6925",
        "-key": "/library/metadata/6925/children",
        "-type": "artist",
        "-title": "Various Artists",
        "-index": "1",
        "-viewCount": "24",
        "-lastViewedAt": "1463346537",
        "-thumb": "/library/metadata/6925/thumb/1464508474",
        "-art": "/library/metadata/6925/art/1464508474",
        "-addedAt": "1455142383",
        "-updatedAt": "1464508474"
      },
      {
        "-ratingKey": "4144",
        "-key": "/library/metadata/4144/children",
        "-type": "artist",
        "-title": "Wax",
        "-summary": "Eight artists go by the name Wax:
1. An American creative/experimental Hip Hop/Rap/Acoustic artist.
2. A pop group active in between 1985 and 1988 consisting of American singer-songwriter Andrew Gold and British singer Graham Gouldman of 10cc fame.
3. An American Pop Punk band known for the 1995 song California
4. A female South Korean singer active in the 2000s (see: 왁스)
5. An alias of Dutch dance producer Robert Meijer
6. A short lived Swedish punk band active in the early 1980s
7. A Japanese rapper from the group SD Junksta
8. An alias of German techno artist Shed.",
        "-index": "1",
        "-thumb": "/library/metadata/4144/thumb/1464508486",
        "-addedAt": "1451589361",
        "-updatedAt": "1464508486",
        "Genre": [
          { "-tag": "Rap" },
          { "-tag": "Hip Hop" }
        ]
      },
      {
        "-ratingKey": "1770",
        "-key": "/library/metadata/1770/children",
        "-type": "artist",
        "-title": "Zack Sekoff",
        "-summary": "18-year-old producer/emcee/bassist",
        "-index": "1",
        "-viewCount": "1",
        "-lastViewedAt": "1454819655",
        "-thumb": "/library/metadata/1770/thumb/1464508480",
        "-addedAt": "1344172070",
        "-updatedAt": "1464508480"
      },
      {
        "-ratingKey": "4126",
        "-key": "/library/metadata/4126/children",
        "-type": "artist",
        "-title": "Zion I",
        "-summary": "Zion I is a hip hop duo from Oakland, California, USA, consisting of producer/DJ, AmpLive and MC Zumbi. The group is known to its followers for Amp's futuristic production techniques, using a mix of live instrumentation and samples, and Zumbi's positive and socially conscious lyrics. Zion I debuted in 1997 with the locally distributed cassette-only EP Enter the Woods. Their first single on Indie label Ground Control Records (\"Inner Light\") paved the way for an album deal and in 2000, they released the critically acclaimed Mind Over Matter. In total, they have released six studio albums, 2000's Mind Over Matter, 2003's Deep Water Slang V2.0, 2005's True & Livin', 2006's Break a Dawn (a Japan exclusive), also in 2006 an album with The Grouch, Heroes in the City of Dope, 2009's The Take Over, 2010's Atomic Clock, and their newest collaborative album with The Grouch, 'Heroes in the Healing of the Nation'.",
        "-index": "1",
        "-thumb": "/library/metadata/4126/thumb/1464508490",
        "-art": "/library/metadata/4126/art/1464508490",
        "-addedAt": "1451589358",
        "-updatedAt": "1464508490",
        "Genre": [
          { "-tag": "Hip Hop" },
          { "-tag": "Rap" }
        ],
        "Country": { "-tag": "United States" }
      }
    ]
  }
}
